[
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Beef Stroganoff",
    "content": "Beef Stroganoff - Ingredients: 1 pound beef sirloin, thinly sliced, 1 small onion, diced, 2 cloves garlic, minced, 1 cup mushrooms, sliced, 1 cup beef broth, 1 cup sour cream, 2 tablespoons flour, 2 tablespoons butter, 1 teaspoon paprika, Salt and pepper to taste, Egg noodles or rice for serving Instructions: In a large skillet, melt butter over medium heat. Add diced onion and minced garlic, sauté until translucent. Add sliced beef and cook until browned. Stir in mushrooms and cook until tender. Sprinkle flour over the mixture and stir to combine. Gradually add beef broth, stirring constantly until the sauce thickens. Stir in sour cream and paprika, season with salt and pepper. Simmer for a few minutes until heated through. Serve over egg noodles or rice.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Chicken Parmesan",
    "content": "Chicken Parmesan - Ingredients: 4 boneless, skinless chicken breasts, 1 cup breadcrumbs, 1/2 cup grated Parmesan cheese, 1 cup marinara sauce, 1 cup mozzarella cheese, shredded, 2 eggs, beaten, 1/2 cup flour, 1/4 cup olive oil, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). Season chicken breasts with salt and pepper. Dredge chicken in flour, dip in beaten eggs, and coat with a mixture of breadcrumbs and grated Parmesan cheese. Heat olive oil in a skillet over medium heat. Cook chicken until golden brown on both sides. Place chicken in a baking dish, top with marinara sauce and shredded mozzarella cheese. Bake for 20-25 minutes until cheese is melted and bubbly. Serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Spaghetti Bolognese",
    "content": "Spaghetti Bolognese - Ingredients: 1 pound ground beef, 1 small onion, diced, 2 cloves garlic, minced, 1 carrot, grated, 1 celery stalk, diced, 1 can (28 ounces) crushed tomatoes, 1/4 cup tomato paste, 1/2 cup red wine (optional), 1 teaspoon dried oregano, 1 teaspoon dried basil, Salt and pepper to taste, Spaghetti for serving, Grated Parmesan cheese for garnish Instructions: In a large skillet, cook ground beef over medium heat until browned. Add diced onion, minced garlic, grated carrot, and diced celery, sauté until vegetables are tender. Stir in crushed tomatoes, tomato paste, red wine (if using), oregano, basil, salt, and pepper. Simmer for 30 minutes, stirring occasionally. Cook spaghetti according to package instructions. Serve Bolognese sauce over spaghetti, garnished with grated Parmesan cheese.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Teriyaki Chicken",
    "content": "Teriyaki Chicken - Ingredients: 4 boneless, skinless chicken thighs, 1/4 cup soy sauce, 1/4 cup mirin, 2 tablespoons sugar, 1 tablespoon sake, 1 teaspoon grated ginger, 1 teaspoon minced garlic, 1 tablespoon vegetable oil, Cooked rice for serving, Sliced green onions for garnish Instructions: In a bowl, mix soy sauce, mirin, sugar, sake, grated ginger, and minced garlic. Marinate chicken thighs in the mixture for at least 30 minutes. Heat vegetable oil in a skillet over medium heat. Cook chicken thighs until browned and cooked through. Pour marinade into the skillet and simmer until thickened. Serve chicken over cooked rice, garnished with sliced green onions.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Shrimp Scampi",
    "content": "Shrimp Scampi - Ingredients: 1 pound large shrimp, peeled and deveined, 4 cloves garlic, minced, 1/4 cup white wine, 1/4 cup chicken broth, 1/4 cup lemon juice, 1/4 cup butter, 2 tablespoons olive oil, 1/4 cup chopped parsley, Salt and pepper to taste, Cooked pasta for serving Instructions: Heat olive oil and butter in a large skillet over medium heat. Add minced garlic and sauté until fragrant. Add shrimp and cook until pink and opaque. Remove shrimp from the skillet and set aside. Pour white wine, chicken broth, and lemon juice into the skillet, simmer until reduced by half. Return shrimp to the skillet and toss to coat in the sauce. Season with salt and pepper, stir in chopped parsley. Serve over cooked pasta.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Beef Tacos",
    "content": "Beef Tacos - Ingredients: 1 pound ground beef, 1 small onion, diced, 2 cloves garlic, minced, 1 packet taco seasoning, 1/2 cup water, Taco shells or tortillas, Shredded lettuce, diced tomatoes, shredded cheese, sour cream, and salsa for toppings Instructions: In a skillet, cook ground beef over medium heat until browned. Add diced onion and minced garlic, sauté until softened. Stir in taco seasoning and water, simmer until thickened. Serve beef mixture in taco shells or tortillas with desired toppings.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Lasagna",
    "content": "Lasagna - Ingredients: 1 pound ground beef, 1 small onion, diced, 2 cloves garlic, minced, 1 jar (24 ounces) marinara sauce, 1 can (15 ounces) ricotta cheese, 1 egg, 1/4 cup grated Parmesan cheese, 1 teaspoon dried basil, 1 teaspoon dried oregano, 9 lasagna noodles, cooked, 2 cups shredded mozzarella cheese Instructions: Preheat oven to 375°F (190°C). In a skillet, cook ground beef, diced onion, and minced garlic until browned. Stir in marinara sauce and simmer for 10 minutes. In a bowl, mix ricotta cheese, egg, grated Parmesan cheese, basil, and oregano. Spread a thin layer of meat sauce in a baking dish. Layer with 3 lasagna noodles, 1/3 of the ricotta mixture, 1/3 of the meat sauce, and 1/3 f the shredded mozzarella cheese. Repeat layers twice more. Cover with foil and bake for 25 minutes. Remove foil and bake for an additional 25 minutes until cheese is melted and bubbly. Let stand for 10 minutes before serving.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Chicken Alfredo",
    "content": "Chicken Alfredo - Ingredients: 4 boneless, skinless chicken breasts, 1 pound fettuccine, 1 cup heavy cream, 1/2 cup grated Parmesan cheese, 1/4 cup butter, 2 cloves garlic, minced, Salt and pepper to taste, Chopped parsley for garnish Instructions: Cook fettuccine according to package instructions. In a skillet, melt butter over medium heat. Add minced garlic and sauté until fragrant. Add chicken breasts and cook until golden and cooked through. Remove chicken from the skillet and set aside. Pour heavy cream into the skillet and bring to a simmer. Stir in grated Parmesan cheese until melted and smooth. Season with salt and pepper. Slice chicken and return to the skillet. Toss cooked fettuccine with the sauce and chicken. Garnish with chopped parsley and serve.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Shepherd's Pie",
    "content": "Shepherd's Pie - Ingredients: 1 pound ground lamb or beef, 1 small onion, diced, 2 cloves garlic, minced, 1 cup frozen peas and carrots, 1 cup beef broth, 2 tablespoons tomato paste, 2 tablespoons Worcestershire sauce, 4 cups mashed potatoes, 1/4 cup grated cheddar cheese, Salt and pepper to taste Instructions: Preheat oven to 400°F (200°C). In a skillet, cook ground lamb or beef, diced onion, and minced garlic until browned. Stir in peas and carrots, beef broth, tomato paste, and Worcestershire sauce. Simmer until thickened, season with salt and pepper. Transfer meat mixture to a baking dish. Spread mashed potatoes over the top and sprinkle with grated cheddar cheese. Bake for 20-25 minutes until golden and bubbly. Serve warm.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Pad Thai",
    "content": "Pad Thai - Ingredients: 8 ounces rice noodles, 1/2 pound shrimp or chicken, 2 eggs, 1 cup bean sprouts, 1/4 cup peanuts, chopped, 2 tablespoons fish sauce, 2 tablespoons tamarind paste, 1 tablespoon sugar, 1 tablespoon lime juice, 1/4 cup green onions, chopped, 2 tablespoons vegetable oil Instructions: Soak rice noodles in warm water until softened, then drain. Sauté shrimp or chicken in vegetable oil until cooked, then set aside. Scramble eggs in the same pan. Add noodles, fish sauce, tamarind paste, sugar, and lime juice, stir to combine. Add bean sprouts, cooked shrimp or chicken, and chopped green onions. Garnish with chopped peanuts and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Beef Bourguignon",
    "content": "Beef Bourguignon - Ingredients: 2 pounds beef chuck, cut into cubes, 1 small onion, diced, 2 cloves garlic, minced, 1 cup red wine, 2 cups beef broth, 1 cup mushrooms, sliced, 1 cup carrots, sliced, 1 cup pearl onions, 2 tablespoons tomato paste, 2 tablespoons flour, 2 tablespoons butter, 1 teaspoon thyme, 1 bay leaf, Salt and pepper to taste Instructions: Preheat oven to 350°F (175°C). In a large pot, melt butter over medium heat. Add diced onion and minced garlic, sauté until translucent. Add beef cubes and cook until browned on all sides. Sprinkle flour over the beef and stir to combine. Add red wine, beef broth, tomato paste, thyme, and bay leaf. Bring to a simmer, then cover and transfer to the oven. Cook for 2 hours, adding mushrooms, carrots, and pearl onions in the last 30 minutes. Season with salt and pepper to taste. Serve warm.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Chicken Cacciatore",
    "content": "Chicken Cacciatore - Ingredients: 4 boneless, skinless chicken thighs, 1 small onion, diced, 2 cloves garlic, minced, 1 bell pepper, sliced, 1 can (14.5 ounces) diced tomatoes, 1/2 cup chicken broth, 1/4 cup red wine, 1 teaspoon dried oregano, 1 teaspoon dried basil, 1/4 cup olives, sliced, 2 tablespoons olive oil, Salt and pepper to taste Instructions: In a large skillet, heat olive oil over medium heat. Add chicken thighs and cook until browned on both sides, then set aside. In the same skillet, sauté diced onion, minced garlic, and sliced bell pepper until softened. Stir in diced tomatoes, chicken broth, red wine, oregano, basil, and olives. Return chicken to the skillet and simmer for 30 minutes until chicken is cooked through. Season with salt and pepper to taste. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Chicken Marsala",
    "content": "Chicken Marsala - Ingredients: 4 boneless, skinless chicken breasts, 1 cup mushrooms, sliced, 1/2 cup Marsala wine, 1/2 cup chicken broth, 1/4 cup flour, 2 tablespoons butter, 2 tablespoons olive oil, Salt and pepper to taste, Chopped parsley for garnish Instructions: Season chicken breasts with salt and pepper, then dredge in flour. In a large skillet, heat olive oil and butter over medium heat. Cook chicken until golden and cooked through, then set aside. In the same skillet, sauté mushrooms until tender. Add Marsala wine and chicken broth, simmer until reduced by half. Return chicken to the skillet and coat with the sauce. Garnish with chopped parsley and serve.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Chicken Tikka Masala",
    "content": "Chicken Tikka Masala - Ingredients: 1 pound chicken breast, cubed, 1 cup yogurt, 2 tablespoons lemon juice, 2 cloves garlic, minced, 1 teaspoon grated ginger, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon turmeric, 1 teaspoon paprika, 1 teaspoon garam masala, 1/2 cup heavy cream, 1 can (14.5 ounces) diced tomatoes, 1 small onion, diced, 2 tablespoons vegetable oil, Salt and pepper to taste, Chopped cilantro for garnish Instructions: In a bowl, mix yogurt, lemon juice, minced garlic, grated ginger, cumin, coriander, turmeric, paprika, and garam masala. Marinate chicken cubes in the mixture for at least 1 hour. In a large skillet, heat vegetable oil over medium heat. Cook diced onion until translucent. Add marinated chicken and cook until browned. Stir in diced tomatoes and simmer for 20 minutes. Add heavy cream and simmer for an additional 10 minutes. Season with salt and pepper to taste. Garnish with chopped cilantro and serve.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Eggplant Parmesan",
    "content": "Eggplant Parmesan - Ingredients: 2 large eggplants, sliced, 1 cup breadcrumbs, 1/2 cup grated Parmesan cheese, 1 cup marinara sauce, 1 cup mozzarella cheese, shredded, 2 eggs, beaten, 1/2 cup flour, 1/4 cup olive oil, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). Season eggplant slices with salt and let sit for 30 minutes, then pat dry. Dredge eggplant in flour, dip in beaten eggs, and coat with a mixture of breadcrumbs and grated Parmesan cheese. Heat olive oil in a skillet over medium heat. Cook eggplant until golden brown on both sides. In a baking dish, layer eggplant slices, marinara sauce, and shredded mozzarella cheese. Repeat layers and top with remaining cheese. Bake for 25-30 minutes until cheese is melted and bubbly. Serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Fish Tacos",
    "content": "Fish Tacos - Ingredients: 1 pound white fish fillets (such as cod or tilapia), 1/2 cup flour, 1/2 cup cornmeal, 1 teaspoon paprika, 1 teaspoon cumin, 1 teaspoon salt, 1/2 teaspoon pepper, 1/2 cup buttermilk, 1/4 cup vegetable oil, Taco shells or tortillas, Shredded cabbage, diced tomatoes, sliced avocado, and lime wedges for toppings Instructions: In a bowl, mix flour, cornmeal, paprika, cumin, salt, and pepper. Dip fish fillets in buttermilk, then coat with the flour mixture. Heat vegetable oil in a skillet over medium heat. Cook fish until golden and cooked through. Serve fish in taco shells or tortillas with desired toppings.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "General Tso's Chicken",
    "content": "General Tso's Chicken - Ingredients: 1 pound boneless, skinless chicken thighs, cubed, 1/4 cup cornstarch, 1/4 cup soy sauce, 1/4 cup rice vinegar, 1/4 cup hoisin sauce, 2 tablespoons sugar, 2 cloves garlic, minced, 1 teaspoon grated ginger, 1/4 cup vegetable oil, Cooked rice for serving, Sliced green onions for garnish Instructions: In a bowl, toss chicken cubes with cornstarch. Heat vegetable oil in a skillet over medium heat. Cook chicken until golden and crispy, then set aside. In the same skillet, sauté minced garlic and grated ginger until fragrant. Stir in soy sauce, rice vinegar, hoisin sauce, and sugar, simmer until thickened. Return chicken to the skillet and toss to coat in the sauce. Serve over cooked rice, garnished with sliced green onions.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Greek Moussaka",
    "content": "Greek Moussaka - Ingredients: 2 large eggplants, sliced, 1 pound ground lamb or beef, 1 small onion, diced, 2 cloves garlic, minced, 1 can (14.5 ounces) diced tomatoes, 1/4 cup red wine, 1 teaspoon cinnamon, 1 teaspoon oregano, 1/4 cup grated Parmesan cheese, 2 tablespoons olive oil, Salt and pepper to taste, 2 cups béchamel sauce Instructions: Preheat oven to 375°F (190°C). Season eggplant slices with salt and let sit for 30 minutes, then pat dry. In a skillet, heat olive oil over medium heat. Cook eggplant until golden on both sides, then set aside. In the same skillet, cook ground lamb or beef, diced onion, and minced garlic until browned. Stir in diced tomatoes, red wine, cinnamon, oregano, salt, and pepper. Simmer for 20 minutes. In a baking dish, layer eggplant slices and meat sauce. Pour béchamel sauce over the top and sprinkle with grated Parmesan cheese. Bake for 30-35 minutes until golden and bubbly. Serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Jambalaya",
    "content": "Jambalaya - Ingredients: 1 pound chicken breast, cubed, 1/2 pound sausage, sliced, 1/2 pound shrimp, peeled and deveined, 1 small onion, diced, 2 cloves garlic, minced, 1 bell pepper, diced, 1 can (14.5 ounces) diced tomatoes, 1 cup chicken broth, 1 cup long-grain rice, 1 teaspoon paprika, 1 teaspoon thyme, 1 teaspoon cayenne pepper, 2 tablespoons olive oil, Salt and pepper to taste Instructions: In a large pot, heat olive oil over medium heat. Cook cubed chicken and sliced sausage until browned, then set aside. In the same pot, sauté diced onion, minced garlic, and diced bell pepper until softened. Stir in diced tomatoes, chicken broth, rice, paprika, thyme, cayenne pepper, salt, and pepper. Bring to a boil, then reduce heat and simmer for 20 minutes. Add shrimp and cooked chicken and sausage, simmer for an additional 10 minutes until shrimp is cooked and rice is tender. Serve warm.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Lamb Curry",
    "content": "Lamb Curry - Ingredients: 1 pound lamb, cubed, 1 small onion, diced, 2 cloves garlic, minced, 1 tablespoon grated ginger, 1 can (14.5 ounces) diced tomatoes, 1 cup coconut milk, 1 tablespoon curry powder, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon turmeric, 1 teaspoon garam masala, 2 tablespoons vegetable oil, Salt and pepper to taste, Chopped cilantro for garnish Instructions: In a large pot, heat vegetable oil over medium heat. Cook diced onion, minced garlic, and grated ginger until fragrant. Add cubed lamb and cook until browned. Stir in diced tomatoes, coconut milk, curry powder, cumin, coriander, turmeric, garam masala, salt, and pepper. Bring to a simmer and cook for 1 hour until lamb is tender. Garnish with chopped cilantro and serve.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Lemon Herb Salmon",
    "content": "Lemon Herb Salmon - Ingredients: 4 salmon fillets, 1 lemon, sliced, 2 cloves garlic, minced, 1/4 cup olive oil, 1 tablespoon fresh dill, chopped, 1 tablespoon fresh parsley, chopped, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). Place salmon fillets on a baking sheet. In a bowl, mix minced garlic, olive oil, chopped dill, chopped parsley, salt, and pepper. Brush the mixture over the salmon fillets. Top each fillet with lemon slices. Bake for 15-20 minutes until salmon is cooked through. Serve warm.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Meatloaf",
    "content": "Meatloaf - Ingredients: 1 pound ground beef, 1/2 pound ground pork, 1 small onion, diced, 2 cloves garlic, minced, 1/2 cup breadcrumbs, 1/4 cup milk, 1 egg, beaten, 1/4 cup ketchup, 1 tablespoon Worcestershire sauce, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Preheat oven to 350°F (175°C). In a large bowl, mix ground beef, ground pork, diced onion, minced garlic, breadcrumbs, milk, beaten egg, ketchup, Worcestershire sauce, salt, and pepper. Shape the mixture into a loaf and place in a baking dish. Bake for 1 hour until cooked through. Let rest before slicing and serving.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Paella",
    "content": "Paella - Ingredients: 1/2 pound chicken breast, cubed, 1/2 pound shrimp, peeled and deveined, 1/2 pound mussels, cleaned, 1 small onion, diced, 2 cloves garlic, minced, 1 bell pepper, diced, 1 cup short-grain rice, 2 cups chicken broth, 1/2 cup white wine, 1/4 cup olive oil, 1 teaspoon saffron, 1 teaspoon paprika, Salt and pepper to taste, Lemon wedges for garnish Instructions: In a large skillet, heat olive oil over medium heat. Cook cubed chicken until browned, then set aside. In the same skillet, sauté diced onion, minced garlic, and diced bell pepper until softened. Stir in rice, chicken broth, white wine, saffron, paprika, salt, and pepper. Bring to a boil, then reduce heat and simmer for 15 minutes. Add shrimp, mussels, and cooked chicken, simmer for an additional 10 minutes until seafood is cooked and rice is tender. Garnish with lemon wedges and serve.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Pork Chops with Apples",
    "content": "Pork Chops with Apples - Ingredients: 4 pork chops, 2 apples, sliced, 1 small onion, sliced, 1/4 cup apple cider, 1/4 cup chicken broth, 2 tablespoons butter, 1 tablespoon olive oil, 1 teaspoon thyme, Salt and pepper to taste Instructions: Season pork chops with salt and pepper. In a large skillet, heat olive oil over medium heat. Cook pork chops until browned on both sides, then set aside. In the same skillet, melt butter and sauté sliced onion and apples until softened. Stir in apple cider, chicken broth, and thyme. Return pork chops to the skillet and simmer for 10 minutes until cooked through. Serve warm.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Mains_1.pdf",
    "title": "Ratatouille",
    "content": "Ratatouille - Ingredients: 1 eggplant, diced, 1 zucchini, diced, 1 bell pepper, diced, 1 small onion, diced, 2 cloves garlic, minced, 4 tomatoes, diced",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Roast Chicken",
    "content": "Roast Chicken - Ingredients: 1 whole chicken, 1 lemon, halved, 4 cloves garlic, minced, 1/4 cup olive oil, 1 tablespoon fresh rosemary, chopped, 1 tablespoon fresh thyme, chopped, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). Season the chicken with salt and pepper. Stuff the cavity with lemon halves and minced garlic. In a bowl, mix olive oil, chopped rosemary, and chopped thyme. Brush the mixture over the chicken. Place the chicken in a roasting pan and roast for 1 hour and 30 minutes until cooked through. Let rest before carving and serving.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Shrimp and Grits",
    "content": "Shrimp and Grits - Ingredients: 1 pound shrimp, peeled and deveined, 1 cup grits, 4 cups water, 1/2 cup cheddar cheese, shredded, 1/4 cup butter, 1 small onion, diced, 2 cloves garlic, minced, 1/4 cup bacon, chopped, 1/4 cup green onions, sliced, Salt and pepper to taste Instructions: In a pot, bring water to a boil and stir in grits. Reduce heat and simmer until thickened, then stir in shredded cheddar cheese and butter. In a skillet, cook chopped bacon until crispy, then set aside. In the same skillet, sauté diced onion and minced garlic until softened. Add shrimp and cook until pink and opaque. Stir in cooked bacon and sliced green onions. Serve shrimp mixture over grits.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Spaghetti Carbonara",
    "content": "Spaghetti Carbonara - Ingredients: 1 pound spaghetti, 4 eggs, 1 cup grated Parmesan cheese, 1/2 cup pancetta, diced, 2 cloves garlic, minced, 1/4 cup heavy cream (optional), Salt and pepper to taste, Chopped parsley for garnish Instructions: Cook spaghetti according to package instructions. In a skillet, cook diced pancetta until crispy, then set aside. In a bowl, whisk eggs, grated Parmesan cheese, and heavy cream (if using). In the same skillet, sauté minced garlic until fragrant. Add cooked spaghetti and toss to coat. Remove from heat and quickly stir in the egg mixture, pancetta, salt, and pepper. Garnish with chopped parsley and serve.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Stuffed Bell Peppers",
    "content": "Stuffed Bell Peppers - Ingredients: 4 bell peppers, tops cut off and seeds removed, 1 pound ground beef, 1 small onion, diced, 2 cloves garlic, minced, 1 cup cooked rice, 1 can (14.5 ounces) diced tomatoes, 1 cup shredded cheese, 1 teaspoon oregano, 1 teaspoon basil, 2 tablespoons olive oil, Salt and pepper to taste",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Sweet and Sour Pork",
    "content": "Sweet and Sour Pork - Ingredients: 1 pound pork tenderloin, cubed, 1 bell pepper, diced, 1 small onion, diced, 1/2 cup pineapple chunks, 1/4 cup ketchup, 1/4 cup rice vinegar, 1/4 cup soy sauce, 1/4 cup brown sugar, 2 tablespoons cornstarch, 2 tablespoons vegetable oil, Cooked rice for serving Instructions: In a bowl, toss pork cubes with cornstarch. Heat vegetable oil in a skillet over medium heat. Cook pork until browned and crispy, then set aside. In the same skillet, sauté diced onion and bell pepper until softened. Stir in pineapple chunks, ketchup, rice vinegar, soy sauce, and brown sugar. Return pork to the skillet and toss to coat in the sauce. Serve over cooked rice.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Tandoori Chicken",
    "content": "Tandoori Chicken - Ingredients: 4 boneless, skinless chicken thighs, 1 cup yogurt, 2 tablespoons lemon juice, 2 cloves garlic, minced, 1 teaspoon grated ginger, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon turmeric, 1 teaspoon paprika, 1 teaspoon garam masala, 1/4 teaspoon cayenne pepper, Salt and pepper to taste Instructions: In a bowl, mix yogurt, lemon juice, minced garlic, grated ginger, cumin, coriander, turmeric, paprika, garam masala, cayenne pepper, salt, and pepper. Marinate chicken thighs in the mixture for at least 1 hour. Preheat oven to 400°F (200°C). Place chicken on a baking sheet and bake for 25-30 minutes until cooked through. Serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Thai Green Curry",
    "content": "Thai Green Curry - Ingredients: 1 pound chicken breast, cubed, 1 small onion, diced, 2 cloves garlic, minced, 1 bell pepper, sliced, 1 cup coconut milk, 1/2 cup chicken broth, 2 tablespoons green curry paste, 1 tablespoon fish sauce, 1 tablespoon brown sugar, 1/4 cup fresh basil leaves, 2 tablespoons vegetable oil, Cooked rice for serving Instructions: In a large skillet, heat vegetable oil over medium heat. Cook diced onion and minced garlic until softened. Add cubed chicken and cook until browned. Stir in green curry paste, coconut milk, chicken broth, fish sauce, and brown sugar. Add sliced bell pepper and simmer for 15 minutes until chicken is cooked through. Stir in fresh basil leaves. Serve over cooked rice.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Turkey Meatballs",
    "content": "Turkey Meatballs - Ingredients: 1 pound ground turkey, 1 small onion, diced, 2 cloves garlic, minced, 1/4 cup breadcrumbs, 1 egg, beaten, 1/4 cup grated Parmesan cheese, 1 teaspoon oregano, 1 teaspoon basil, Salt and pepper to taste, 2 tablespoons olive oil, 1 jar (24 ounces) marinara sauce Instructions: In a bowl, mix ground turkey, diced onion, minced garlic, breadcrumbs, beaten egg, grated Parmesan cheese, oregano, basil, salt, and pepper. Form mixture into meatballs. In a skillet, heat olive oil over medium heat. Cook meatballs until browned on all sides. Add marinara sauce and simmer for 20 minutes until meatballs are cooked through. Serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Vegetable Stir-Fry",
    "content": "Vegetable Stir-Fry - Ingredients: 1 cup broccoli florets, 1 cup bell peppers, sliced, 1 cup snow peas, 1 small onion, diced, 2 cloves garlic, minced, 2 tablespoons soy sauce, 1 tablespoon oyster sauce, 1 tablespoon sesame oil, 1 teaspoon cornstarch, 1/4 cup water, Cooked rice for serving Instructions: In a small bowl, mix soy sauce, oyster sauce, sesame oil, cornstarch, and water. In a large skillet, heat sesame oil over medium heat. Sauté diced onion and minced garlic until fragrant. Add broccoli, bell peppers, and snow peas, stir-fry until tender. Pour sauce over the vegetables and cook until thickened. Serve over cooked rice.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Vietnamese Pho",
    "content": "Vietnamese Pho - Ingredients: 1 pound beef sirloin, thinly sliced, 8 cups beef broth, 1 small onion, sliced, 2 cloves garlic, minced, 1 piece ginger, sliced, 2 star anise, 1 cinnamon stick, 1 tablespoon fish sauce, 1 tablespoon soy sauce, 8 ounces rice noodles, Fresh basil, cilantro, bean sprouts, lime wedges, and sliced jalapeños for garnish Instructions: In a large pot, bring beef broth to a boil. Add sliced onion, minced garlic, sliced ginger, star anise, and cinnamon stick. Simmer for 30 minutes. Stir in fish sauce and soy sauce. Cook rice noodles according to package instructions. Divide noodles and thinly sliced beef among bowls. Pour hot broth over the top. Garnish with fresh basil, cilantro, bean sprouts, lime wedges, and sliced jalapeños. Serve immediately.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Yakitori",
    "content": "Yakitori - Ingredients: 1 pound chicken thighs, cut into bite-sized pieces, 1/4 cup soy sauce, 1/4 cup mirin, 1/4 cup sake, 2 tablespoons sugar, Bamboo skewers, Sliced green onions for garnish Instructions: In a bowl, mix soy sauce, mirin, sake, and sugar. Marinate chicken pieces in the mixture for at least 30 minutes. Thread chicken onto bamboo skewers. Preheat grill to medium-high heat. Grill chicken, brushing with marinade, until cooked through. Garnish with sliced green onions and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Zucchini Noodles with Pesto",
    "content": "Zucchini Noodles with Pesto - Ingredients: 4 zucchinis, spiralized into noodles, 1/2 cup basil pesto, 1/4 cup cherry tomatoes, halved, 1/4 cup grated Parmesan cheese, 2 tablespoons olive oil, Salt and pepper to taste Instructions: In a large skillet, heat olive oil over medium heat. Add zucchini noodles and cook until tender. Stir in basil pesto and cherry tomatoes. Season with salt and pepper. Sprinkle with grated Parmesan cheese and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Beef and Broccoli",
    "content": "Beef and Broccoli - Ingredients: 1 pound beef sirloin, thinly sliced, 2 cups broccoli florets, 1 small onion, diced, 2 cloves garlic, minced, 1/4 cup soy sauce, 1/4 cup beef broth, 2 tablespoons oyster sauce, 1 tablespoon cornstarch, 2 tablespoons vegetable oil, Cooked rice for serving Instructions: In a small bowl, mix soy sauce, beef broth, oyster sauce, and cornstarch. In a large skillet, heat vegetable oil over medium heat. Cook sliced beef until browned, then set aside. In the same skillet, sauté diced onion and minced garlic until fragrant. Add broccoli florets and stir-fry until tender. Return beef to the skillet and pour sauce over the top. Cook until sauce is thickened. Serve over cooked rice.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Chicken Fajitas",
    "content": "Chicken Fajitas - Ingredients: 1 pound chicken breast, sliced, 1 bell pepper, sliced, 1 small onion, sliced, 2 tablespoons fajita seasoning, 2 tablespoons vegetable oil, Tortillas for serving, Shredded lettuce, diced tomatoes, shredded cheese, sour cream, and salsa for toppings Instructions: In a large skillet, heat vegetable oil over medium heat. Cook sliced chicken, bell pepper, and onion until chicken is cooked through and vegetables are tender. Stir in fajita seasoning and cook for an additional 2 minutes. Serve chicken and vegetables in tortillas with desired toppings.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Chicken Piccata",
    "content": "Chicken Piccata - Ingredients: 4 boneless, skinless chicken breasts, 1/4 cup flour, 1/4 cup lemon juice, 1/4 cup chicken broth, 1/4 cup capers, 2 tablespoons butter, 2 tablespoons olive oil, Salt and pepper to taste, Chopped parsley for garnish Instructions: Season chicken breasts with salt and pepper, then dredge in flour. In a large skillet, heat olive oil and butter over medium heat. Cook chicken until golden and cooked through, then set aside. In the same skillet, add lemon juice, chicken broth, and capers, simmer until reduced by half. Return chicken to the skillet and coat with the sauce. Garnish with chopped parsley and serve.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Chicken Pot Pie",
    "content": "Chicken Pot Pie - Ingredients: 1 pound chicken breast, cubed, 1 small onion, diced, 2 cloves garlic, minced, 1 cup frozen peas and carrots, 1 cup chicken broth, 1/2 cup milk, 1/4 cup flour, 1/4 cup butter, 1 teaspoon thyme, 1 teaspoon rosemary, Salt and pepper to taste, 1 pie crust Instructions: Preheat oven to 375°F (190°C). In a large skillet, melt butter over medium heat. Cook diced onion and minced garlic until softened. Add cubed chicken and cook until browned. Stir in flour and cook for 1 minute. Gradually add chicken broth and milk, stirring constantly until thickened. Add frozen peas and carrots, thyme, rosemary, salt, and pepper. Pour mixture into a baking dish and top with pie crust. Bake for 25-30 minutes until crust is golden. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Chicken Stir-Fry",
    "content": "Chicken Stir-Fry - Ingredients: 1 pound chicken breast, sliced, 1 cup broccoli florets, 1 cup bell peppers, sliced, 1 small onion, diced, 2 cloves garlic, minced, 2 tablespoons soy sauce, 1 tablespoon oyster sauce, 1 tablespoon sesame oil, 1 teaspoon cornstarch, 1/4 cup water, Cooked rice for serving Instructions: In a small bowl, mix soy sauce, oyster sauce, sesame oil, cornstarch, and water. In a large skillet, heat sesame oil over medium heat. Cook sliced chicken until browned, then set aside. In the same skillet, sauté diced onion and minced garlic until fragrant. Add broccoli and bell peppers, stir-fry until tender. Return chicken to the skillet and pour sauce over the top. Cook until sauce is thickened. Serve over cooked rice.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Coq au Vin",
    "content": "Coq au Vin - Ingredients: 4 chicken thighs, 1 small onion, diced, 2 cloves garlic, minced, 1 cup red wine, 1 cup chicken broth, 1 cup mushrooms, sliced, 1 cup carrots, sliced, 1/4 cup bacon, chopped, 2 tablespoons tomato paste, 2 tablespoons flour, 2 tablespoons butter, 1 teaspoon thyme, 1 bay leaf, Salt and pepper to taste Instructions: Preheat oven to 350°F (175°C). In a large pot, melt butter over medium heat. Cook chopped bacon until crispy, then set aside. In the same pot, cook chicken thighs until browned on all sides, then set aside. Add diced onion, minced garlic, sliced mushrooms, and carrots, sauté until softened. Stir in flour and cook for 1 minute. Add red wine, chicken broth, tomato paste, thyme, bay leaf, salt, and pepper. Return chicken and bacon to the pot. Bring to a simmer, then cover and transfer to the oven. Cook for 1 hour until chicken is tender. Serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Crab Cakes",
    "content": "Crab Cakes - Ingredients: 1 pound crab meat, 1 small onion, diced, 1/4 cup breadcrumbs, 1/4 cup mayonnaise, 1 egg, beaten, 1 tablespoon Dijon mustard, 1 tablespoon Worcestershire sauce, 1 teaspoon Old Bay seasoning, 2 tablespoons vegetable oil, Lemon wedges for serving Instructions: In a bowl, mix crab meat, diced onion, breadcrumbs, mayonnaise, beaten egg, Dijon mustard, Worcestershire sauce, and Old Bay seasoning. Form mixture into patties. In a skillet, heat vegetable oil over medium heat. Cook crab cakes until golden and crispy on both sides. Serve with lemon wedges.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Enchiladas",
    "content": "Enchiladas - Ingredients: 1 pound ground beef, 1 small onion, diced, 2 cloves garlic, minced, 1 can (14.5 ounces) enchilada sauce, 1 cup shredded cheese, 8 tortillas, 1 teaspoon cumin, 1 teaspoon chili powder, 2 tablespoons vegetable oil, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). In a skillet, heat vegetable oil over medium heat. Cook ground beef, diced onion, and minced garlic until browned. Stir in cumin, chili powder, salt, and pepper. Fill tortillas with beef mixture and roll up. Place enchiladas in a baking dish and pour enchilada sauce over the top. Sprinkle with shredded cheese. Bake for 20-25 minutes until cheese is melted and bubbly. Serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Fettuccine Alfredo",
    "content": "Fettuccine Alfredo - Ingredients: 1 pound fettuccine, 1 cup heavy cream, 1/2 cup grated Parmesan cheese, 1/4 cup butter, 2 cloves garlic, minced, Salt and pepper to taste, Chopped parsley for garnish Instructions: Cook fettuccine according to package instructions. In a skillet, melt butter over medium heat. Add minced garlic and sauté until fragrant. Pour in heavy cream and bring to a simmer. Stir in grated Parmesan cheese until melted and smooth. Season with salt and pepper. Toss cooked fettuccine with the sauce. Garnish with chopped parsley and serve.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Fish and Chips",
    "content": "Fish and Chips - Ingredients: 1 pound white fish fillets (such as cod or haddock), 1 cup flour, 1 cup beer, 1 teaspoon baking powder, 1 teaspoon salt, 1/2 teaspoon pepper, 4 large potatoes, peeled and cut into fries, Vegetable oil for frying, Lemon wedges for serving Instructions: In a bowl, mix flour, baking powder, salt, and pepper. Gradually whisk in beer until smooth. Heat vegetable oil in a deep fryer or large pot to 350°F (175°C). Dip fish fillets in the batter and fry until golden and crispy. Drain on paper towels. Fry potatoes until golden and crispy. Serve fish and chips with lemon wedges.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Grilled Cheese Sandwich",
    "content": "Grilled Cheese Sandwich - Ingredients: 8 slices bread, 4 slices cheddar cheese, 4 slices mozzarella cheese, 1/4 cup butter Instructions: Preheat a skillet over medium heat. Butter one side of each slice of bread. Place a slice of cheddar cheese and a slice of mozzarella cheese between two slices of bread, buttered side out. Cook sandwiches in the skillet until golden brown and cheese is melted. Serve warm.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Grilled Salmon",
    "content": "Grilled Salmon - Ingredients: 4 salmon fillets, 1/4 cup olive oil, 2 cloves garlic, minced, 1 lemon, juiced, 1 tablespoon fresh dill, chopped, Salt and pepper to taste Instructions: Preheat grill to medium-high heat. In a bowl, mix olive oil, minced garlic, lemon juice, chopped dill, salt, and pepper. Brush the mixture over the salmon fillets. Grill salmon for 4-5 minutes per side until cooked through. Serve warm.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Grilled Shrimp Skewers",
    "content": "Grilled Shrimp Skewers - Ingredients: 1 pound large shrimp, peeled and deveined, 1/4 cup olive oil, 2 cloves garlic, minced, 1 lemon, juiced, 1 tablespoon fresh parsley, chopped, Salt and pepper to taste, Bamboo skewers Instructions: Preheat grill to medium-high heat. In a bowl, mix olive oil, minced garlic, lemon juice, chopped parsley, salt, and pepper. Thread shrimp onto bamboo skewers. Brush the mixture over the shrimp. Grill shrimp for 2-3 minutes per side until pink and opaque. Serve warm.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Lamb Chops with Mint Sauce",
    "content": "Lamb Chops with Mint Sauce - Ingredients: 4 lamb chops, 1/4 cup olive oil, 2 cloves garlic, minced, 1 tablespoon fresh rosemary, chopped, Salt and pepper to taste, 1/2 cup fresh mint leaves, 1/4 cup white vinegar, 1 tablespoon sugar Instructions: Preheat grill to medium-high heat. In a bowl, mix olive oil, minced garlic, chopped rosemary, salt, and pepper. Brush the mixture over the lamb chops. Grill lamb chops for 4-5 minutes per side until cooked to desired doneness. In a blender, combine mint leaves, white vinegar, and sugar, blend until smooth. Serve lamb chops with mint sauce.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Lobster Tail",
    "content": "Lobster Tail - Ingredients: 4 lobster tails, 1/4 cup butter, melted, 2 cloves garlic, minced, 1 lemon, juiced, 1 tablespoon fresh parsley, chopped, Salt and pepper to taste Instructions: Preheat oven to 425°F (220°C). Using kitchen shears, cut the top shell of the lobster tails lengthwise. Gently pull the lobster meat out of the shell and place it on top. In a bowl, mix melted butter, minced garlic, lemon juice, chopped parsley, salt, and pepper. Brush the mixture over the lobster meat. Place lobster tails on a baking sheet and bake for 12-15 minutes until cooked through. Serve warm.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Osso Buco",
    "content": "Osso Buco - Ingredients: 4 veal shanks, 1 small onion, diced, 2 cloves garlic, minced, 1 cup white wine, 2 cups beef broth, 1 can (14.5 ounces) diced tomatoes, 1 carrot, diced, 1 celery stalk, diced, 1 teaspoon thyme, 1 bay leaf, 2 tablespoons olive oil, Salt and pepper to taste Instructions: Preheat oven to 350°F (175°C). In a large pot, heat olive oil over medium heat. Season veal shanks with salt and pepper, then brown on all sides. Remove veal shanks and set aside. In the same pot, sauté diced onion, minced garlic, diced carrot, and diced celery until softened. Stir in white wine, beef broth, diced tomatoes, thyme, and bay leaf. Return veal shanks to the pot and bring to a simmer. Cover and transfer to the oven. Cook for 2 hours until veal is tender. Serve warm.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Mains_2.pdf",
    "title": "Pad See Ew",
    "content": "Pad See Ew - Ingredients: 8 ounces wide rice noodles, 1/2 pound chicken breast, sliced, 1 cup broccoli florets, 2 eggs, 2 tablespoons soy sauce, 2 tablespoons oyster sauce, 1 tablespoon sugar, 1 tablespoon vegetable oil Instructions: Soak rice noodles in warm water until softened, then drain. In a large skillet, heat vegetable oil over medium heat. Cook sliced chicken until browned, then set aside. Scramble eggs in the same skillet. Add broccoli and stir-fry until tender. Add noodles, soy sauce, oyster sauce, and sugar, stir to combine.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Peking Duck",
    "content": "Peking Duck - Ingredients: 1 whole duck, 1/4 cup soy sauce, 1/4 cup honey, 2 tablespoons hoisin sauce, 2 tablespoons rice vinegar, 2 cloves garlic, minced, 1 teaspoon five-spice powder, 1 teaspoon grated ginger, 1/4 cup green onions, sliced, Mandarin pancakes for serving Instructions: Preheat oven to 375°F (190°C). In a bowl, mix soy sauce, honey, hoisin sauce, rice vinegar, minced garlic, five-spice powder, and grated ginger. Brush the mixture over the duck. Place duck on a roasting rack and roast for 1 hour and 30 minutes until skin is crispy. Let rest before carving. Serve duck with sliced green onions and mandarin pancakes.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Pork Schnitzel",
    "content": "Pork Schnitzel - Ingredients: 4 pork cutlets, 1/2 cup flour, 2 eggs, beaten, 1 cup breadcrumbs, 1/4 cup vegetable oil, 1 lemon, sliced, Salt and pepper to taste Instructions: Season pork cutlets with salt and pepper. Dredge cutlets in flour, dip in beaten eggs, and coat with breadcrumbs. In a large skillet, heat vegetable oil over medium heat. Cook cutlets until golden and crispy on both sides. Serve with lemon slices.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Quiche Lorraine",
    "content": "Quiche Lorraine - Ingredients: 1 pie crust, 6 slices bacon, cooked and crumbled, 1 small onion, diced, 1 cup grated Gruyère cheese, 3 eggs, 1 cup heavy cream, 1/2 teaspoon salt, 1/4 teaspoon pepper Instructions: Preheat oven to 375°F (190°C). Place pie crust in a pie dish. Sprinkle cooked bacon, diced onion, and grated Gruyère cheese over the crust. In a bowl, whisk eggs, heavy cream, salt, and pepper. Pour egg mixture over the filling. Bake for 30-35 minutes until set and golden. Serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Ramen",
    "content": "Ramen - Ingredients: 4 cups chicken broth, 1/4 cup soy sauce, 2 tablespoons miso paste, 2 cloves garlic, minced, 1 piece ginger, sliced, 1/2 pound pork belly, sliced, 4 eggs, soft-boiled, 8 ounces ramen noodles, Sliced green onions, nori, and sesame seeds for garnish Instructions: In a large pot, bring chicken broth, soy sauce, miso paste, minced garlic, and sliced ginger to a boil. Reduce heat and simmer for 20 minutes. In a skillet, cook sliced pork belly until crispy. Cook ramen noodles according to package instructions. Divide noodles among bowls, top with broth, pork belly, soft-boiled eggs, sliced green nions, nori, and sesame seeds. Serve immediately.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Roast Beef",
    "content": "Roast Beef - Ingredients: 1 beef roast (3-4 pounds), 2 cloves garlic, minced, 1 tablespoon fresh rosemary, chopped, 1 tablespoon fresh thyme, chopped, 1/4 cup olive oil, Salt and pepper to taste Instructions: Preheat oven to 350°F (175°C). In a bowl, mix minced garlic, chopped rosemary, chopped thyme, olive oil, salt, and pepper. Rub the mixture over the beef roast. Place the roast in a roasting pan and cook for 1 hour and 30 minutes until desired doneness. Let rest before slicing and serving.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Salmon en Papillote",
    "content": "Salmon en Papillote - Ingredients: 4 salmon fillets, 1 lemon, sliced, 1 small onion, sliced, 1 zucchini, sliced, 1/4 cup olive oil, 1 tablespoon fresh dill, chopped, Salt and pepper to taste, Parchment paper Instructions: Preheat oven to 375°F (190°C). Cut parchment paper into large squares. Place a salmon fillet in the center of each square. Top with lemon slices, sliced onion, and sliced zucchini. Drizzle with olive oil and sprinkle with chopped dill, salt, and pepper. Fold the parchment paper over the salmon and seal the edges to form a packet. Place packets on a baking sheet and bake for 20-25 minutes until salmon is cooked through. Serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Baked Ziti",
    "content": "Baked Ziti - Ingredients: 1 pound ziti pasta, 1 pound ground beef or Italian sausage, 1 small onion, diced, 2 cloves garlic, minced, 1 jar (24 ounces) marinara sauce, 1 cup ricotta cheese, 1 cup shredded mozzarella cheese, 1/2 cup grated Parmesan cheese, 1 teaspoon dried oregano, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). Cook ziti according to package instructions, then drain. In a skillet, cook ground beef or sausage with diced onion and minced garlic until browned. Stir in marinara sauce, oregano, salt, and pepper, and simmer for 10 minutes. In a baking dish, layer half the ziti, half the sauce, dollops of ricotta, and half the mozzarella. Repeat layers. Top with grated Parmesan cheese. Bake for 25-30 minutes until bubbly and golden. Serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Butter Chicken",
    "content": "Butter Chicken - Ingredients: 1 pound boneless chicken thighs, cubed, 1 cup plain yogurt, 1 tablespoon lemon juice, 2 cloves garlic, minced, 1 teaspoon grated ginger, 1 teaspoon garam masala, 1 teaspoon turmeric, 1 teaspoon cumin, 1 can (14.5 ounces) tomato puree, 1/2 cup heavy cream, 2 tablespoons butter, Salt and pepper to taste, Chopped cilantro for garnish, Cooked rice or naan for serving Instructions: In a bowl, mix yogurt, lemon juice, garlic, ginger, garam masala, turmeric, and cumin. Marinate chicken in the mixture for at least 1 hour. In a skillet, melt butter over medium heat. Add marinated chicken and cook until browned. Stir in tomato puree and simmer for 20 minutes. Add heavy cream, season with salt and pepper, and simmer for another 10 minutes. Garnish with cilantro and serve with rice or naan.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Chili Con Carne",
    "content": "Chili Con Carne - Ingredients: 1 pound ground beef, 1 small onion, diced, 2 cloves garlic, minced, 1 can (15 ounces) kidney beans, drained, 1 can (14.5 ounces) diced tomatoes, 1/4 cup tomato paste, 1 cup beef broth, 1 tablespoon chili powder, 1 teaspoon cumin, 1 teaspoon paprika, Salt and pepper to taste, Shredded cheese and sour cream for garnish Instructions: In a large pot, cook ground beef with diced onion and garlic over medium heat until browned. Stir in kidney beans, diced tomatoes, tomato paste, beef broth, chili powder, cumin, and paprika. Bring to a boil, then reduce heat and simmer for 30 minutes, stirring occasionally. Season with salt and pepper. Serve hot, garnished with shredded cheese and sour cream.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Gnocchi with Sage Butter",
    "content": "Gnocchi with Sage Butter - Ingredients: 1 pound potato gnocchi, 1/4 cup butter, 2 cloves garlic, minced, 8 fresh sage leaves, 1/2 cup grated Parmesan cheese, Salt and pepper to taste Instructions: Cook gnocchi according to package instructions, then drain. In a large skillet, melt butter over medium heat. Add minced garlic and sage leaves, sauté until fragrant and sage is crispy. Add cooked gnocchi to the skillet and toss to coat in the butter sauce. Season with salt and pepper, and sprinkle with Parmesan cheese. Serve warm.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Honey Garlic Pork Ribs",
    "content": "Honey Garlic Pork Ribs - Ingredients: 2 pounds pork ribs, 1/4 cup honey, 1/4 cup soy sauce, 2 tablespoons rice vinegar, 3 cloves garlic, minced, 1 teaspoon grated ginger, 1 teaspoon paprika, Salt and pepper to taste, Sliced green onions for garnish Instructions: Preheat oven to 300°F (150°C). Season ribs with salt, pepper, and paprika, then place in a baking dish. In a bowl, mix honey, soy sauce, rice vinegar, garlic, and ginger. Pour over the ribs. Cover with foil and bake for 2.5 hours, basting occasionally with the sauce. Remove foil, increase oven to 400°F (200°C), and bake for 15-20 minutes until caramelized. Garnish with green onions and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Moroccan Chicken Tagine",
    "content": "Moroccan Chicken Tagine - Ingredients: 4 chicken thighs, 1 small onion, diced, 2 cloves garlic, minced, 1 cup chicken broth, 1/2 cup dried apricots, chopped, 1/2 cup green olives, 1 tablespoon olive oil, 1 teaspoon cumin, 1 teaspoon cinnamon, 1 teaspoon turmeric, Salt and pepper to taste, Chopped parsley for garnish, Cooked couscous for serving Instructions: In a large pot, heat olive oil over medium heat. Brown chicken thighs on all sides, then set aside. Sauté onion and garlic until softened. Stir in cumin, cinnamon, and turmeric, then add chicken broth, apricots, and olives. Return chicken to the pot, cover, and simmer for 45 minutes until tender. Season with salt and pepper. Garnish with parsley and serve over couscous.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Mushroom Risotto",
    "content": "Mushroom Risotto - Ingredients: 1 cup Arborio rice, 4 cups chicken or vegetable broth, 1 small onion, diced, 2 cloves garlic, minced, 1 cup mushrooms, sliced, 1/2 cup white wine, 1/2 cup grated Parmesan cheese, 2 tablespoons butter, 2 tablespoons olive oil, Salt and pepper to taste, Chopped parsley for garnish Instructions: Heat broth in a pot and keep warm. In a large skillet, heat olive oil and 1 tablespoon butter over medium heat. Sauté onion, garlic, and mushrooms until tender. Add rice and stir for 1-2 minutes until lightly toasted. Pour in white wine and cook until absorbed. Add warm broth, one ladle at a time, stirring until absorbed before adding more, until rice is creamy and tender (about 20 minutes). Stir in remaining butter and Parmesan cheese, season with salt and pepper. Garnish with parsley and serve.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Pulled Pork Sandwiches",
    "content": "Pulled Pork Sandwiches - Ingredients: 2 pounds pork shoulder, 1 small onion, sliced, 2 cloves garlic, minced, 1 cup barbecue sauce, 1/2 cup chicken broth, 1 tablespoon brown sugar, 1 teaspoon smoked paprika, Salt and pepper to taste, Buns for serving, Coleslaw for topping (optional) Instructions: Season pork shoulder with salt, pepper, and smoked paprika. Place onion and garlic in a slow cooker, then add pork. Mix barbecue sauce, chicken broth, and brown sugar, and pour over pork. Cook on low for 8 hours or high for 4 hours until pork shreds easily. Shred pork with forks and mix with sauce. Serve on buns with coleslaw if desired.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Stuffed Chicken Breasts",
    "content": "Stuffed Chicken Breasts - Ingredients: 4 boneless, skinless chicken breasts, 1/2 cup spinach, chopped, 1/2 cup feta cheese, crumbled, 1/4 cup sun-dried tomatoes, chopped, 2 cloves garlic, minced, 2 tablespoons olive oil, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). Cut a pocket into each chicken breast. In a bowl, mix spinach, feta, sun-dried tomatoes, and garlic. Stuff the mixture into the chicken pockets and secure with toothpicks if needed. Season chicken with salt and pepper. Heat olive oil in a skillet over medium heat and sear chicken on both sides. Transfer to a baking dish and bake for 20-25 minutes until cooked through. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Mains_3.pdf",
    "title": "Vegetable Lasagna",
    "content": "Vegetable Lasagna - Ingredients: 9 lasagna noodles, cooked, 1 small onion, diced, 2 cloves garlic, minced, 1 zucchini, sliced, 1 bell pepper, diced, 1 cup spinach, chopped, 1 jar (24 ounces) marinara sauce, 1 can (15 ounces) ricotta cheese, 1 egg, 1 cup shredded mozzarella cheese, 1/4 cup grated Parmesan cheese, 2 tablespoons olive oil, Salt and pepper to taste Instructions: Preheat oven to 375°F (190°C). In a skillet, heat olive oil over medium heat. Sauté onion, garlic, zucchini, and bell pepper until tender. Add spinach and cook until wilted. In a bowl, mix ricotta cheese, egg, salt, and pepper. In a baking dish, spread a thin layer of marinara sauce. Layer 3 noodles, half the ricotta mixture, half the vegetables, and 1/3 of the mozzarella. Repeat layers. Top with remaining noodles, marinara sauce, mozzarella, and Parmesan cheese. Cover with foil and bake for 25 minutes. Remove foil and bake for another 20 minutes until bubbly. Let stand for 10 minutes before serving.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Acarajé",
    "content": "Acarajé - Ingredients: 2 cups black-eyed peas, 1 small onion, 2 cloves garlic, 1 teaspoon salt, Oil for frying Instructions: Soak black-eyed peas overnight, then peel and rinse. Blend peas with diced onion, minced garlic, and salt until smooth. Form mixture into balls and fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Agedashi Tofu",
    "content": "Agedashi Tofu - Ingredients: 1 block tofu, 1/4 cup cornstarch, 1 cup dashi broth, 2 tablespoons soy sauce, 1 tablespoon mirin, 1/4 cup green onions, 1/4 cup grated daikon Instructions: Cut tofu into cubes and coat with cornstarch. Fry in hot oil until golden. Heat dashi broth with soy sauce and mirin. Serve tofu in broth, topped with green onions and grated daikon.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Aloo Gobi",
    "content": "Aloo Gobi - Ingredients: 2 potatoes, 1 cauliflower, 1 small onion, 2 cloves garlic, 1 teaspoon cumin, 1 teaspoon turmeric, 1 teaspoon coriander, 1 teaspoon garam masala, 1 teaspoon salt, 2 tablespoons oil Instructions: Peel and dice potatoes, cut cauliflower into florets. Heat oil in a pan and sauté diced onion and minced garlic until translucent. Add cumin, turmeric, coriander, and garam masala, cook for 1 minute. Add potatoes and cauliflower, stir to coat with spices. Cover and cook until vegetables are tender, stirring occasionally. Add salt to taste and serve.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Albondigas",
    "content": "Albondigas - Ingredients: 1/2 pound ground beef, 1/2 pound ground pork, 1 small onion, 2 cloves garlic, 1/4 cup breadcrumbs, 1 egg, 1 teaspoon paprika, 1 teaspoon salt, 1/2 teaspoon pepper, 1/4 cup olive oil, 1 cup tomato sauce Instructions: Mix ground beef, ground pork, diced onion, minced garlic, breadcrumbs, beaten egg, paprika, salt, and pepper in a bowl. Form mixture into meatballs. Heat olive oil in a pan and brown meatballs on all sides. Add tomato sauce and simmer for 20 minutes. Serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Antipasto",
    "content": "Antipasto - Ingredients: Assorted cured meats (salami, prosciutto), Cheeses (mozzarella, provolone), Olives, Marinated vegetables (artichokes, peppers), Breadsticks Instructions: Arrange meats, cheeses, olives, and vegetables on a platter. Serve with breadsticks.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Arancini",
    "content": "Arancini - Ingredients: 2 cups cooked risotto, 1/2 cup mozzarella, 1/2 cup flour, 2 eggs, 1 cup breadcrumbs, 1 cup vegetable oil Instructions: Form risotto into balls and stuff with a cube of mozzarella. Dredge balls in flour, dip in beaten eggs, and coat with breadcrumbs. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Baba Ganoush",
    "content": "Baba Ganoush - Ingredients: 2 eggplants, 1/4 cup tahini, 1/4 cup lemon juice, 2 cloves garlic, 1/4 cup olive oil, 1 teaspoon salt Instructions: Roast eggplants until soft, then peel and mash. Blend mashed eggplant, tahini, lemon juice, minced garlic, and salt in a food processor. Slowly add olive oil while blending until smooth. Serve with a drizzle of olive oil.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Baked Beans",
    "content": "Baked Beans - Ingredients: 4 cups cooked navy beans, 1 small onion, 1/2 cup molasses, 1/4 cup brown sugar, 1/4 cup ketchup, 1 tablespoon mustard, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Preheat oven to 350°F (175°C). Sauté diced onion until translucent. Mix beans, onion, molasses, brown sugar, ketchup, mustard, salt, and pepper in a baking dish. Bake for 1 hour, stirring occasionally. Serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bammy",
    "content": "Bammy - Ingredients: 2 cups grated cassava, 1/4 cup coconut milk, 1 teaspoon salt, Oil for frying Instructions: Mix grated cassava with coconut milk and salt. Form mixture into flat cakes. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Banchan",
    "content": "Banchan - Ingredients: Assorted small side dishes like pickled radish, spinach, bean sprouts, kimchi Instructions: Prepare each side dish separately. Arrange on small plates. Serve as accompaniments to the main meal.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Banh Beo",
    "content": "Banh Beo - Ingredients: 1 cup rice flour, 1/2 cup water, 1/2 cup coconut milk, 1/4 cup shrimp, 1/4 cup green onions, 1/4 cup fried shallots, 1 teaspoon salt, 1/2 teaspoon sugar Instructions: Mix rice flour, water, coconut milk, salt, and sugar to form a batter. Pour batter into small dishes and steam until set. Sauté chopped shrimp and green onions until cooked. Top steamed cakes with shrimp, green onions, and fried shallots. Serve with dipping sauce.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Banh Xeo",
    "content": "Banh Xeo - Ingredients: 1 cup rice flour, 1/2 cup coconut milk, 1/2 cup water, 1/2 pound shrimp, 1/2 pound pork, 1 small onion, 1/2 cup bean sprouts, 1/4 cup green onions, 1/4 cup cilantro, 1 teaspoon turmeric, 1 teaspoon salt, Oil for frying Instructions: Mix rice flour, coconut milk, water, turmeric, and salt to form a batter. Sauté sliced pork, shrimp, and diced onion until cooked. Heat oil in a pan and pour in a ladle of batter, swirling to coat the pan. Add cooked pork, shrimp, bean sprouts, green onions, and cilantro. Fold pancake in half and cook until crispy. Serve with lettuce and dipping sauce.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Basturma",
    "content": "Basturma - Ingredients: 1 pound beef tenderloin, 1/4 cup paprika, 2 tablespoons cumin, 2 tablespoons fenugreek, 1 tablespoon garlic powder, 1 tablespoon salt Instructions: Rub beef with salt and let cure in the refrigerator for 24 hours. Rinse and pat dry. Mix paprika, cumin, fenugreek, and garlic powder, then coat beef with the mixture. Wrap in cheesecloth and hang in a cool, dry place for 1-2 weeks. Slice thinly and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Batbout",
    "content": "Batbout - Ingredients: 2 1/4 teaspoons active dry yeast, 1 teaspoon sugar, 1 cup warm water, 3 cups flour, 1 teaspoon salt, 1/4 cup olive oil Instructions: Dissolve yeast and sugar in warm water, let sit until foamy. Mix flour and salt in a bowl, then add yeast mixture and olive oil. Knead until smooth, then let rise until doubled. Divide dough into balls and roll out into circles. Cook on a hot griddle until puffed and golden. Serve warm.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bhindi Masala",
    "content": "Bhindi Masala - Ingredients: 1 pound okra, 1 small onion, 2 cloves garlic, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon turmeric, 1 teaspoon garam masala, 1 teaspoon salt, 2 tablespoons oil Instructions: Wash and dry okra, then cut into pieces. Heat oil in a pan and sauté diced onion and minced garlic until translucent. Add cumin, coriander, turmeric, and garam masala, cook for 1 minute. Add okra and stir to coat with spices. Cook until okra is tender, stirring occasionally. Add salt to taste and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bobotie",
    "content": "Bobotie - Ingredients: 1 pound ground beef, 1 small onion, 2 cloves garlic, 1/4 cup raisins, 1/4 cup almonds, 1 tablespoon curry powder, 1 teaspoon salt, 1/2 teaspoon pepper, 2 eggs, 1/2 cup milk, 1/4 cup breadcrumbs Instructions: Preheat oven to 350°F (175°C). Sauté diced onion and minced garlic until softened. Add ground beef, raisins, almonds, curry powder, salt, and pepper, cook until beef is browned. Transfer mixture to a baking dish. Beat eggs with milk and pour over the beef mixture. Sprinkle with breadcrumbs. Bake for 30 minutes until set and golden. Serve warm.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bok Choy with Garlic",
    "content": "Bok Choy with Garlic - Ingredients: 1 pound bok choy, 2 cloves garlic, 2 tablespoons soy sauce, 1 tablespoon sesame oil Instructions: Sauté minced garlic in sesame oil until fragrant. Add bok choy and stir-fry until tender. Add soy sauce and cook for 2 minutes. Serve warm.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bolinho de Bacalhau",
    "content": "Bolinho de Bacalhau - Ingredients: 1 pound salted cod, 4 potatoes, 1 small onion, 2 cloves garlic, 1/4 cup parsley, 2 eggs, 1 cup breadcrumbs, Oil for frying Instructions: Soak salted cod in water overnight, then rinse and flake. Boil potatoes until tender, then mash. Mix cod with mashed potatoes, diced onion, minced garlic, chopped parsley, and beaten eggs. Form mixture into balls and coat with breadcrumbs. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bouillabaisse",
    "content": "Bouillabaisse - Ingredients: 1 pound fish fillets, 1/2 pound shrimp, 1/2 pound mussels, 1 small onion, 2 cloves garlic, 4 tomatoes, 4 cups fish stock, 1/2 cup white wine, 1 teaspoon saffron, 1 teaspoon thyme, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Sauté diced onion and minced garlic in olive oil until softened. Add diced tomatoes, fish stock, wine, saffron, thyme, salt, and pepper, simmer for 20 minutes. Add fish fillets, shrimp, and mussels, cook until seafood is done. Serve hot with crusty bread.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bratkartoffeln (Fried Potatoes)",
    "content": "Bratkartoffeln (Fried Potatoes) - Ingredients: 4 potatoes, 1 small onion, 1/4 cup bacon, 2 tablespoons butter, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Boil potatoes until tender, then slice. Cook diced bacon until crispy, then remove and set aside. Sauté sliced potatoes and diced onion in butter until golden. Stir in bacon, salt, and pepper. Serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Briam",
    "content": "Briam - Ingredients: 2 potatoes, 2 zucchinis, 2 eggplants, 2 tomatoes, 1 small onion, 4 cloves garlic, 1/4 cup olive oil, 1 teaspoon oregano, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Preheat oven to 375°F (190°C). Slice potatoes, zucchinis, eggplants, and tomatoes. Sauté diced onion and minced garlic in olive oil until softened. Layer vegetables in a baking dish, seasoning with oregano, salt, and pepper. Pour sautéed onion and garlic over the top. Bake for 45 minutes until vegetables are tender. Serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Briouats",
    "content": "Briouats - Ingredients: 1/2 pound ground beef, 1 small onion, 2 cloves garlic, 1/4 cup parsley, 1 teaspoon cumin, 1 teaspoon cinnamon, 1 teaspoon salt, 1/2 teaspoon pepper, 1 package phyllo dough, 1/4 cup butter, Oil for frying Instructions: Sauté ground beef, diced onion, and minced garlic until cooked. Stir in chopped parsley, cumin, cinnamon, salt, and pepper. Cut phyllo dough into strips and brush with melted butter. Place a spoonful of filling on each strip and fold into triangles. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bruschetta",
    "content": "Bruschetta - Ingredients: 1 baguette, 4 tomatoes, 1/4 cup basil, 2 cloves garlic, 1/4 cup olive oil, 1 teaspoon salt Instructions: Slice baguette and toast until golden. Dice tomatoes and chop basil. Mix tomatoes, basil, minced garlic, olive oil, and salt. Spoon mixture onto toasted bread and serve.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Bulgur Pilaf",
    "content": "Bulgur Pilaf - Ingredients: 1 cup bulgur, 2 cups chicken broth, 1 small onion, 1 carrot, 1/4 cup parsley, 2 tablespoons olive oil, 1 teaspoon salt Instructions: Sauté diced onion and grated carrot in olive oil until softened. Add bulgur and cook for 2 minutes. Pour in chicken broth and bring to a boil. Reduce heat, cover, and simmer until bulgur is tender. Stir in chopped parsley and salt. Serve warm.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Ca Tim Nuong (Grilled Eggplant)",
    "content": "Ca Tim Nuong (Grilled Eggplant) - Ingredients: 2 eggplants, 2 cloves garlic, 2 tablespoons fish sauce, 1 tablespoon lime juice, 1 tablespoon sugar, 1/4 cup cilantro Instructions: Grill eggplants until charred and tender. Peel and slice eggplants. Mix minced garlic, fish sauce, lime juice, and sugar in a bowl. Toss eggplants with the dressing. Garnish with chopped cilantro and serve.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Callaloo",
    "content": "Callaloo - Ingredients: 1 pound callaloo leaves, 1 small onion, 2 cloves garlic, 1/4 cup coconut milk, 1 teaspoon thyme, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Sauté diced onion and minced garlic until softened. Add callaloo leaves and cook until wilted. Stir in coconut milk, thyme, salt, and pepper. Simmer for 10 minutes. Serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Canh Chua",
    "content": "Canh Chua - Ingredients: 4 cups fish stock, 1/2 pound fish fillets, 1 cup pineapple, 1 cup tomatoes, 1 cup bean sprouts, 2 stalks lemongrass, 2-3 Thai chilies, 2 tablespoons fish sauce, 2 tablespoons tamarind paste, 1 tablespoon sugar, 1/4 cup cilantro Instructions: Bring fish stock to a boil. Add lemongrass, chilies, and tamarind paste, simmer for 10 minutes. Add pineapple, tomatoes, and fish fillets, cook until fish is done. Stir in fish sauce, sugar, and bean sprouts. Garnish with chopped cilantro and serve.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Caprese Salad",
    "content": "Caprese Salad - Ingredients: 4 tomatoes, 1 pound fresh mozzarella, 1/4 cup basil, 2 tablespoons olive oil, 1 tablespoon balsamic glaze, 1 teaspoon salt Instructions: Slice tomatoes and mozzarella. Arrange on a plate, alternating slices. Sprinkle with chopped basil, olive oil, balsamic glaze, and salt. Serve immediately.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Carrot Salad",
    "content": "Carrot Salad - Ingredients: 4 carrots, 1/4 cup raisins, 1/4 cup parsley, 1/4 cup lemon juice, 1/4 cup olive oil, 1 teaspoon cumin, 1 teaspoon salt Instructions: Grate carrots and mix with raisins and chopped parsley. Whisk lemon juice, olive oil, cumin, and salt, then pour over salad. Toss well and serve chilled.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Ceviche",
    "content": "Ceviche - Ingredients: 1 pound fresh fish or shrimp, 1 cup lime juice, 1 small onion, 2 tomatoes, 1 jalapeño, 1/4 cup cilantro, 1 teaspoon salt Instructions: Dice fish or shrimp and place in a bowl. Pour lime juice over the seafood and let marinate for 30 minutes. Dice onion, tomatoes, and jalapeño. Chop cilantro. Mix all ingredients together and add salt. Serve chilled.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Cha Gio",
    "content": "Cha Gio - Ingredients: 1 package spring roll wrappers, 1/2 pound ground pork, 1/2 cup shrimp, 1/2 cup mushrooms, 1/4 cup carrots, 1/4 cup green onions, 2 cloves garlic, 2 tablespoons fish sauce, 1 tablespoon sugar, Oil for frying Instructions: Mix ground pork, chopped shrimp, diced mushrooms, julienned carrots, chopped green onions, minced garlic, fish sauce, and sugar in a bowl. Place a spoonful of filling on each wrapper and roll tightly. Fry in hot oil until golden. Drain on paper towels and serve with dipping sauce.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Chakchouka",
    "content": "Chakchouka - Ingredients: 4 tomatoes, 2 bell peppers, 1 small onion, 2 cloves garlic, 1/4 cup olive oil, 1 teaspoon cumin, 1 teaspoon paprika, 1 teaspoon salt, 4 eggs, 1/4 cup cilantro Instructions: Sauté diced onion, minced garlic, and sliced bell peppers in olive oil until softened. Add diced tomatoes, cumin, paprika, and salt, simmer for 10 minutes. Make wells in the sauce and crack eggs into each well. Cover and cook until eggs are set. Garnish with chopped cilantro and serve warm.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Chana Masala",
    "content": "Chana Masala - Ingredients: 2 cups cooked chickpeas, 1 small onion, 2 cloves garlic, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon garam masala, 1 teaspoon turmeric, 1 teaspoon salt, 1 can diced tomatoes, 2 tablespoons oil Instructions: Heat oil in a pan and sauté diced onion and minced garlic until translucent. Add cumin, coriander, garam masala, and turmeric, cook for 1 minute. Add chickpeas and diced tomatoes, stir to combine. Simmer for 15 minutes, stirring occasionally. Add salt to taste and serve.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Chapati",
    "content": "Chapati - Ingredients: 2 cups flour, 1/4 cup oil, 1/2 cup water, 1 teaspoon salt Instructions: Mix flour, oil, water, and salt to form a dough, then let rest. Divide dough into balls and roll out into circles. Cook on a hot griddle until golden on both sides. Serve warm.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Char Siu",
    "content": "Char Siu - Ingredients: 1 pound pork shoulder, 1/4 cup hoisin sauce, 2 tablespoons soy sauce, 2 tablespoons honey, 1 tablespoon rice wine, 1 teaspoon five-spice powder, 1 teaspoon garlic powder Instructions: Mix hoisin sauce, soy sauce, honey, rice wine, five-spice powder, and garlic powder in a bowl. Marinate pork in the mixture for at least 2 hours. Preheat oven to 375°F (190°C). Place pork on a baking sheet and roast for 45 minutes, basting occasionally. Let rest before slicing and serving.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Chawanmushi",
    "content": "Chawanmushi - Ingredients: 2 eggs, 1 cup dashi broth, 1 tablespoon soy sauce, 1 tablespoon mirin, 1/4 cup chicken, 1/4 cup shrimp, 1/4 cup mushrooms Instructions: Beat eggs with dashi broth, soy sauce, and mirin. Place chicken, shrimp, and mushrooms in small bowls. Pour egg mixture over the top. Steam for 15 minutes until set. Serve warm.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_1.pdf",
    "title": "Chiles Rellenos",
    "content": "Chiles Rellenos - Ingredients: 4 poblano peppers, 1 cup shredded cheese, 1/2 cup flour, 4 eggs, 1 cup vegetable oil, 1 cup tomato sauce Instructions: Roast peppers until charred, then peel and remove seeds. Stuff peppers with cheese. Separate eggs and beat whites until stiff, then fold in yolks. Dredge peppers in flour, then dip in egg mixture. Fry in hot oil until golden. Serve with warmed tomato sauce.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Churros",
    "content": "Churros - Ingredients: 1 cup water, 1/2 cup butter, 1 cup flour, 3 eggs, 1/4 cup sugar, 1 teaspoon cinnamon, Oil for frying Instructions: Bring water and butter to a boil. Add flour and stir until a dough forms. Remove from heat and beat in eggs one at a time. Heat oil in a pan. Pipe dough into hot oil and fry until golden. Drain on paper towels and roll in a mixture of sugar and cinnamon. Serve warm.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Coconut Rice",
    "content": "Coconut Rice - Ingredients: 1 cup rice, 1 cup coconut milk, 1 cup water, 1/4 cup shredded coconut, 1 teaspoon salt Instructions: Sauté shredded coconut until lightly browned. Add rice, coconut milk, water, and salt. Bring to a boil, then reduce heat and simmer until rice is tender. Serve warm.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Coleslaw",
    "content": "Coleslaw - Ingredients: 1 small cabbage, 2 carrots, 1/2 cup mayonnaise, 2 tablespoons apple cider vinegar, 1 tablespoon sugar, 1 teaspoon salt Instructions: Shred cabbage and grate carrots. Mix mayonnaise, vinegar, sugar, and salt in a bowl. Toss cabbage and carrots with dressing. Chill for at least 1 hour before serving.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Cornbread",
    "content": "Cornbread - Ingredients: 1 cup cornmeal, 1 cup flour, 1/4 cup sugar, 1 tablespoon baking powder, 1/2 teaspoon salt, 1 cup milk, 1/4 cup vegetable oil, 1 egg Instructions: Preheat oven to 400°F (200°C). Mix cornmeal, flour, sugar, baking powder, and salt in a bowl. Add milk, oil, and beaten egg, stir until combined. Pour batter into a greased baking pan. Bake for 20-25 minutes until golden. Serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Coxinha",
    "content": "Coxinha - Ingredients: 2 cups shredded chicken, 1 small onion, 2 cloves garlic, 1/4 cup parsley, 1/4 cup cream cheese, 1 cup flour, 1 cup breadcrumbs, 2 eggs, Oil for frying Instructions: Sauté diced onion and minced garlic until softened. Mix shredded chicken with onion, garlic, chopped parsley, and cream cheese. Form mixture into drumstick shapes. Dredge in flour, dip in beaten eggs, and coat with breadcrumbs. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Croque Monsieur",
    "content": "Croque Monsieur - Ingredients: 8 slices bread, 4 slices ham, 1 cup grated Gruyère cheese, 1/4 cup béchamel sauce, 2 tablespoons butter Instructions: Preheat oven to 400°F (200°C). Spread béchamel sauce on 4 slices of bread. Top with ham and grated cheese, then cover with remaining bread slices. Melt butter in a pan and toast sandwiches until golden. Transfer to a baking sheet, top with more béchamel sauce and cheese. Bake for 10 minutes until cheese is melted and bubbly. Serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Croquetas",
    "content": "Croquetas - Ingredients: 1/2 cup butter, 1/2 cup flour, 2 cups milk, 1/2 cup ham, 1/4 cup grated cheese, 1 teaspoon salt, 1/2 teaspoon nutmeg, 1 cup breadcrumbs, 2 eggs, Oil for frying Instructions: Melt butter in a saucepan, stir in flour to make a roux. Gradually add milk, stirring constantly until thickened. Stir in diced ham, grated cheese, salt, and nutmeg. Let mixture cool, then form into croquettes. Dredge croquettes in flour, dip in beaten eggs, and coat with breadcrumbs. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Dal Tadka",
    "content": "Dal Tadka - Ingredients: 1 cup lentils, 4 cups water, 1 small onion, 2 cloves garlic, 1 teaspoon cumin, 1 teaspoon turmeric, 1 teaspoon coriander, 1 teaspoon garam masala, 1 teaspoon salt, 2 tablespoons oil Instructions: Rinse lentils and cook in water until tender. Heat oil in a pan and sauté diced onion and minced garlic until translucent. Add cumin, turmeric, coriander, and garam masala, cook for 1 minute. Add cooked lentils and stir to combine. Simmer for 10 minutes, stirring occasionally. Add salt to taste and serve.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Deviled Eggs",
    "content": "Deviled Eggs - Ingredients: 6 eggs, 1/4 cup mayonnaise, 1 tablespoon mustard, 1 tablespoon vinegar, 1 teaspoon salt, 1/2 teaspoon paprika Instructions: Hard-boil eggs, then peel and halve. Remove yolks and mash with mayonnaise, mustard, vinegar, and salt. Spoon or pipe yolk mixture into egg whites. Sprinkle with paprika and serve.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Dolmas",
    "content": "Dolmas - Ingredients: 1 jar grape leaves, 1 cup rice, 1 small onion, 1/4 cup pine nuts, 1/4 cup currants, 1/4 cup lemon juice, 1/4 cup olive oil, 1 teaspoon salt Instructions: Rinse grape leaves and pat dry. Sauté diced onion in olive oil until translucent. Add rice, pine nuts, and currants, cook for 5 minutes. Add 1 cup water, lemon juice, and salt, simmer until rice is tender. Place a spoonful of rice mixture on each grape leaf and roll tightly. Arrange dolmas in a pot, cover with water, and simmer for 30 minutes. Serve warm or chilled.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Dumplings",
    "content": "Dumplings - Ingredients: 1 package dumpling wrappers, 1/2 pound ground pork, 1/2 cup chopped cabbage, 1/4 cup chopped green onions, 2 cloves garlic, 1 tablespoon soy sauce, 1 teaspoon sesame oil, Oil for frying Instructions: Mix ground pork, cabbage, green onions, minced garlic, soy sauce, and sesame il in a bowl. Place a spoonful of filling on each wrapper and fold to seal. Fry in hot oil until golden, then steam for 5 minutes. Serve with dipping sauce.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Edamame",
    "content": "Edamame - Ingredients: 1 pound edamame (soybeans in pods), 1 tablespoon sea salt Instructions: Steam or boil edamame until tender (about 5 minutes). Drain and sprinkle with sea salt. Serve warm.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Egusi Soup",
    "content": "Egusi Soup - Ingredients: 1 cup ground egusi seeds, 1/2 pound beef, 1/2 pound fish, 1 small onion, 2 cloves garlic, 4 tomatoes, 1/4 cup palm oil, 1 teaspoon crayfish powder, 1 teaspoon salt, 1/2 teaspoon pepper, 4 cups water, 1/4 cup spinach Instructions: Sauté diced onion and minced garlic in palm oil until softened. Add diced tomatoes, ground egusi seeds, and crayfish powder, cook for 5 minutes. Add beef, fish, salt, pepper, and water, simmer until meat is tender. Stir in chopped spinach and cook for 5 minutes. Serve warm.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Egg Rolls",
    "content": "Egg Rolls - Ingredients: 1 package egg roll wrappers, 1 cup shredded cabbage, 1/2 cup grated carrots, 1/2 cup bean sprouts, 1/4 cup chopped green onions, 2 tablespoons soy sauce, 1 tablespoon sesame oil, Oil for frying Instructions: Mix cabbage, carrots, bean sprouts, green onions, soy sauce, and sesame oil in a bowl. Place a spoonful of filling on each wrapper and roll tightly. Fry in hot oil until golden. Drain on paper towels and serve with dipping sauce.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Elote",
    "content": "Elote - Ingredients: 4 ears of corn, 1/4 cup mayonnaise, 1/4 cup sour cream, 1/2 cup cotija cheese, 1 teaspoon chili powder, 1 lime Instructions: Grill the corn until charred. Mix mayonnaise and sour cream in a bowl. Brush the mixture onto the corn. Sprinkle with cotija cheese and chili powder. Squeeze lime juice over the top and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Empanadas",
    "content": "Empanadas - Ingredients: 2 cups flour, 1/2 cup butter, 1/4 cup water, 1 egg, 1/2 pound ground beef, 1 small onion, 2 cloves garlic, 1/4 cup olives, 1/4 cup raisins, 1 teaspoon cumin, 1 teaspoon paprika, 1 teaspoon salt, Oil for frying Instructions: Mix flour, butter, water, and beaten egg to form a dough, then let rest. Sauté ground beef, diced onion, minced garlic, chopped olives, and raisins with cumin, paprika, and salt until cooked. Roll out dough and cut into circles. Place a spoonful of filling on each circle and fold to seal. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Escalivada",
    "content": "Escalivada - Ingredients: 2 eggplants, 2 bell peppers, 2 tomatoes, 1 small onion, 1/4 cup olive oil, 1 teaspoon salt Instructions: Preheat oven to 400°F (200°C). Roast eggplants, bell peppers, tomatoes, and onion until tender. Peel and slice vegetables. Arrange on a plate and drizzle with olive oil. Sprinkle with salt and serve warm or at room temperature.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Falafel",
    "content": "Falafel - Ingredients: 1 can chickpeas, 1 small onion, 2 cloves garlic, 1/4 cup parsley, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon salt, 1/4 cup flour, Oil for frying Instructions: Drain and rinse chickpeas. Blend chickpeas, diced onion, minced garlic, chopped parsley, cumin, coriander, and salt in a food processor. Add flour and mix until combined. Form mixture into balls and fry in hot oil until golden. Drain on paper towels and serve.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Farofa",
    "content": "Farofa - Ingredients: 2 cups cassava flour, 1/4 cup butter, 1 small onion, 2 cloves garlic, 1/4 cup bacon, 1/4 cup parsley, 1 teaspoon salt Instructions: Sauté diced bacon, onion, and minced garlic in butter until crispy. Add cassava flour and cook, stirring constantly, until golden. Stir in chopped parsley and salt. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Fattoush",
    "content": "Fattoush - Ingredients: 2 pita breads, 4 tomatoes, 1 cucumber, 1 small red onion, 1/4 cup parsley, 1/4 cup mint, 1/4 cup lemon juice, 1/4 cup olive oil, 1 teaspoon sumac, 1 teaspoon salt Instructions: Toast pita breads until crispy, then break into pieces. Dice tomatoes and cucumber, slice red onion. Mix vegetables with chopped parsley and mint. Whisk lemon juice, olive oil, sumac, and salt, then pour over salad. Toss well and serve.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Fava",
    "content": "Fava - Ingredients: 1 cup yellow split peas, 1 small onion, 2 cloves garlic, 1/4 cup olive oil, 1/4 cup lemon juice, 1 teaspoon salt Instructions: Rinse split peas and cook in water until tender. Sauté diced onion and minced garlic in olive oil until softened. Blend cooked peas with onion, garlic, lemon juice, and salt until smooth. Serve warm or chilled.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Feijão Tropeiro",
    "content": "Feijão Tropeiro - Ingredients: 2 cups cooked beans, 1/4 cup bacon, 1 small onion, 2 cloves garlic, 1/4 cup cassava flour, 1/4 cup parsley, 1 teaspoon salt Instructions: Sauté diced bacon, onion, and minced garlic until crispy. Add cooked beans and cassava flour, stir to combine. Stir in chopped parsley and salt. Serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Festival",
    "content": "Festival - Ingredients: 2 cups flour, 1/4 cup cornmeal, 1/4 cup sugar, 1 tablespoon baking powder, 1/2 teaspoon salt, 1/4 cup milk, Oil for frying Instructions: Mix flour, cornmeal, sugar, baking powder, and salt in a bowl. Add milk and stir until dough forms. Roll out dough and cut into strips. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Focaccia",
    "content": "Focaccia - Ingredients: 2 1/4 teaspoons active dry yeast, 1 teaspoon sugar, 1 cup warm water, 2 1/2 cups flour, 1 teaspoon salt, 1/4 cup olive oil, Rosemary, Sea salt Instructions: Dissolve yeast and sugar in warm water, let sit until foamy. Mix flour and salt in a bowl, then add yeast mixture and olive oil. Knead until smooth, then let rise until doubled. Press dough into a baking pan, dimple with fingers, and sprinkle with rosemary and sea salt. Bake at 400°F (200°C) for 20-25 minutes until golden.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Freekeh Salad",
    "content": "Freekeh Salad - Ingredients: 1 cup freekeh, 2 cups water, 1 small onion, 1/4 cup parsley, 1/4 cup mint, 1/4 cup lemon juice, 1/4 cup olive oil, 1 teaspoon salt Instructions: Rinse freekeh and cook in water until tender, then drain. Sauté diced onion in olive oil until softened. Mix freekeh with sautéed onion, chopped parsley, and mint. Whisk lemon juice, olive oil, and salt, then pour over salad. Toss well and serve.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Fried Plantains",
    "content": "Fried Plantains - Ingredients: 2 ripe plantains, 1 cup vegetable oil, 1 teaspoon salt Instructions: Peel and slice plantains. Heat oil in a pan and fry plantain slices until golden. Drain on paper towels and sprinkle with salt. Serve warm.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Fried Rice",
    "content": "Fried Rice - Ingredients: 2 cups cooked rice, 1 small onion, 1/2 cup peas, 1/2 cup diced carrots, 2 eggs, 2 tablespoons soy sauce, 1 tablespoon sesame oil, 1/4 cup chopped green onions Instructions: Sauté diced onion, peas, and carrots in sesame oil until softened. Push vegetables to the side and scramble eggs in the same pan. Add cooked rice and soy sauce, stir to combine. Cook until heated through. Garnish with chopped green onions and serve.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Fufu",
    "content": "Fufu - Ingredients: 2 cups cassava flour, 4 cups water Instructions: Bring water to a boil. Gradually add cassava flour, stirring constantly until thickened. Continue to cook, stirring, until smooth and elastic. Serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gamja Jorim",
    "content": "Gamja Jorim - Ingredients: 4 potatoes, 1/4 cup soy sauce, 2 tablespoons sugar, 1 tablespoon sesame oil, 1/4 cup water, 1 tablespoon sesame seeds Instructions: Peel and dice potatoes. Sauté potatoes in sesame oil until lightly browned. Add soy sauce, sugar, and water, simmer until potatoes are tender. Garnish with sesame seeds and serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Garlic Bread",
    "content": "Garlic Bread - Ingredients: 1 baguette, 1/2 cup butter, 4 cloves garlic, 1/4 cup parsley, 1 teaspoon salt Instructions: Preheat oven to 375°F (190°C). Slice baguette in half lengthwise. Mix softened butter with minced garlic, chopped parsley, and salt. Spread mixture on bread. Bake for 10-15 minutes until golden. Serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gazpacho",
    "content": "Gazpacho - Ingredients: 4 tomatoes, 1 cucumber, 1 small red onion, 1 bell pepper, 2 cloves garlic, 1/4 cup olive oil, 2 tablespoons red wine vinegar, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Dice tomatoes, cucumber, onion, and bell pepper. Blend vegetables with minced garlic, olive oil, vinegar, salt, and pepper until smooth. Chill for at least 1 hour before serving.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gigantes Plaki",
    "content": "Gigantes Plaki - Ingredients: 2 cups giant beans, 1 small onion, 2 cloves garlic, 4 tomatoes, 1/4 cup olive oil, 1 teaspoon oregano, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Soak beans overnight, then cook until tender. Sauté diced onion and minced garlic in olive oil until softened. Add diced tomatoes, oregano, salt, and pepper, simmer for 10 minutes. Mix beans with tomato sauce and transfer to a baking dish. Bake at 375°F (190°C) for 30 minutes. Serve warm.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Goi Cuon (Spring Rolls)",
    "content": "Goi Cuon (Spring Rolls) - Ingredients: 1 package rice paper wrappers, 1/2 pound shrimp, 1/2 cup rice vermicelli, 1/2 cup lettuce, 1/4 cup mint, 1/4 cup cilantro, 1/4 cup basil, 1/4 cup carrots, 1/4 cup cucumber Instructions: Cook shrimp and slice in half. Cook rice vermicelli according to package instructions, then drain. Soak rice paper wrappers in warm water until pliable. Place a small amount of shrimp, vermicelli, lettuce, mint, cilantro, basil, julienned carrots, and cucumber on each wrapper. Roll tightly and serve with dipping sauce.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gomae (Spinach with Sesame Dressing)",
    "content": "Gomae (Spinach with Sesame Dressing) - Ingredients: 1 bunch spinach, 2 tablespoons sesame seeds, 1 tablespoon soy sauce, 1 tablespoon sugar, 1 tablespoon mirin Instructions: Blanch spinach in boiling water, then rinse in cold water and squeeze out excess moisture. Toast sesame seeds and grind them. Mix sesame seeds with soy sauce, sugar, and mirin. Toss spinach with dressing and serve.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gratin Dauphinois",
    "content": "Gratin Dauphinois - Ingredients: 4 potatoes, 1 cup heavy cream, 1/2 cup milk, 2 cloves garlic, 1/2 cup grated Gruyère cheese, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Preheat oven to 375°F (190°C). Peel and thinly slice potatoes. Rub a baking dish with a cut clove of garlic. Layer potatoes in the dish, seasoning with salt and pepper. Mix cream, milk, and minced garlic, pour over potatoes. Sprinkle with grated Gruyère cheese. Bake for 45 minutes until golden and bubbly. Serve warm.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Greek Salad",
    "content": "Greek Salad - Ingredients: 4 tomatoes, 1 cucumber, 1 small red onion, 1/4 cup olives, 1/4 cup feta cheese, 1/4 cup olive oil, 2 tablespoons red wine vinegar, 1 teaspoon oregano, 1 teaspoon salt Instructions: Dice tomatoes and cucumber, slice red onion. Mix vegetables with olives and crumbled feta cheese. Whisk olive oil, vinegar, oregano, and salt, then pour over salad. Toss well and serve.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Green Bean Casserole",
    "content": "Green Bean Casserole - Ingredients: 4 cups green beans, 1 can cream of mushroom soup, 1/2 cup milk, 1 cup fried onions, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Preheat oven to 350°F (175°C). Cook green beans until tender. Mix soup, milk, salt, and pepper in a baking dish. Add green beans and half of the fried onions, stir to combine. Bake for 25 minutes. Top with remaining fried onions and bake for an additional 5 minutes. Serve warm.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Guacamole",
    "content": "Guacamole - Ingredients: 3 avocados, 1 lime, 1 small onion, 2 tomatoes, 1 teaspoon salt, 1 tablespoon chopped cilantro, 1 teaspoon minced garlic Instructions: Cut avocados in half, remove the pit, and scoop out the flesh into a bowl. Mash the avocados with a fork. Add lime juice, diced onion, chopped tomatoes, salt, cilantro, and garlic. Mix well and serve immediately.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gurkensalat (Cucumber Salad)",
    "content": "Gurkensalat (Cucumber Salad) - Ingredients: 2 cucumbers, 1/4 cup sour cream, 2 tablespoons vinegar, 1 tablespoon sugar, 1 teaspoon dill, 1 teaspoon salt Instructions: Slice cucumbers thinly. Mix sour cream, vinegar, sugar, dill, and salt in a bowl. Toss cucumbers with the dressing. Serve chilled.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Gyeran Jjim",
    "content": "Gyeran Jjim - Ingredients: 4 eggs, 1 cup water, 1/4 cup green onions, 1 teaspoon salt, 1/2 teaspoon sesame oil Instructions: Beat eggs with water, salt, and chopped green onions. Pour mixture into a heatproof bowl. Steam for 10-15 minutes until set. Drizzle with sesame oil and serve warm.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_2.pdf",
    "title": "Harira",
    "content": "Harira - Ingredients: 1 cup lentils, 1/2 cup chickpeas, 1 small onion",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Horta",
    "content": "Horta - Ingredients: 1 pound dandelion greens, 1/4 cup olive oil, 1/4 cup lemon juice, 1 teaspoon salt Instructions: Boil dandelion greens until tender, then drain. Toss greens with olive oil, lemon juice, and salt. Serve warm or chilled.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Hot and Sour Soup",
    "content": "Hot and Sour Soup - Ingredients: 4 cups chicken broth, 1/2 cup sliced mushrooms, 1/4 cup bamboo shoots, 1/4 cup tofu, 2 tablespoons soy sauce, 2 tablespoons rice vinegar, 1 tablespoon cornstarch, 1 teaspoon chili paste, 1 egg, 1/4 cup chopped green onions Instructions: Bring chicken broth to a boil. Add mushrooms, bamboo shoots, tofu, soy sauce, rice vinegar, and chili paste. Mix cornstarch with water and add to the soup, stirring until thickened. Beat egg and slowly pour into the soup, stirring constantly. Garnish with chopped green onions and serve.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Hummus",
    "content": "Hummus - Ingredients: 1 can chickpeas, 1/4 cup tahini, 1/4 cup lemon juice, 2 cloves garlic, 1/4 cup olive oil, 1 teaspoon salt Instructions: Drain and rinse chickpeas. Blend chickpeas, tahini, lemon juice, minced garlic, and salt in a food processor. Slowly add olive oil while blending until smooth. Serve with a drizzle of olive oil.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Japchae",
    "content": "Japchae - Ingredients: 8 ounces sweet potato noodles, 1/2 pound beef, 1 small onion, 1 carrot, 1 bell pepper, 1 cup spinach, 2 tablespoons soy sauce, 1 tablespoon sesame oil, 1 tablespoon sugar, 1 tablespoon sesame seeds Instructions: Cook noodles according to package instructions, then drain. Sauté sliced beef, diced onion, julienned carrot, and bell pepper in sesame oil until cooked. Add spinach and cook until wilted. Mix noodles with soy sauce, sugar, and sesame seeds. Combine with cooked beef and vegetables. Serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Jerk Vegetables",
    "content": "Jerk Vegetables - Ingredients: 1 cup broccoli, 1 cup bell peppers, 1 cup zucchini, 1 small onion, 2 cloves garlic, 2 tablespoons jerk seasoning, 1/4 cup olive oil Instructions: Toss vegetables with minced garlic, jerk seasoning, and olive oil. Roast at 400°F (200°C) until tender. Serve warm.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Johnny Cakes",
    "content": "Johnny Cakes - Ingredients: 2 cups flour, 1/4 cup sugar, 1 tablespoon baking powder, 1/2 teaspoon salt, 1/4 cup butter, 1/2 cup milk, Oil for frying Instructions: Mix flour, sugar, baking powder, and salt in a bowl. Cut in cold butter until mixture resembles coarse crumbs. Add milk and stir until dough forms. Roll out dough and cut into circles. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Jollof Rice",
    "content": "Jollof Rice - Ingredients: 2 cups rice, 1 small onion, 2 cloves garlic, 4 tomatoes, 1/4 cup tomato paste, 1/4 cup vegetable oil, 1 teaspoon thyme, 1 teaspoon curry powder, 1 teaspoon salt, 1/2 teaspoon pepper, 4 cups chicken broth Instructions: Sauté diced onion and minced garlic in vegetable oil until softened. Add diced tomatoes, tomato paste, thyme, curry powder, salt, and pepper, cook for 5 minutes. Stir in rice and cook for 2 minutes. Add chicken broth and bring to a boil. Reduce heat, cover, and simmer until rice is tender. Serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Kachumbari",
    "content": "Kachumbari - Ingredients: 4 tomatoes, 1 small onion, 1 cucumber, 1/4 cup cilantro, 1/4 cup lemon juice, 1 teaspoon salt Instructions: Dice tomatoes, onion, and cucumber. Mix vegetables with chopped cilantro, lemon juice, and salt. Serve chilled.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Käsespätzle (Cheese Noodles)",
    "content": "Käsespätzle (Cheese Noodles) - Ingredients: 2 cups flour, 1/2 cup milk, 3 eggs, 1 teaspoon salt, 1/4 teaspoon nutmeg, 1/4 cup butter, 1 cup grated cheese, 1 small onion Instructions: Mix flour, milk, beaten eggs, salt, and nutmeg to form a batter. Press batter through a spaetzle maker or colander into boiling water. Cook until spaetzle floats to the surface, then drain. Sauté sliced onion in butter until golden. Layer spaetzle and grated cheese in a baking dish, top with sautéed onion. Bake at 350°F (175°C) for 15 minutes until cheese is melted. Serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Kartoffelsalat (Potato Salad)",
    "content": "Kartoffelsalat (Potato Salad) - Ingredients: 4 potatoes, 1 small onion, 1/4 cup bacon, 1/4 cup vinegar, 1/4 cup chicken broth, 1 tablespoon mustard, 1 teaspoon sugar, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Boil potatoes until tender, then dice. Cook diced bacon until crispy, then remove and set aside. Sauté diced onion in bacon fat until softened. Mix vinegar, chicken broth, mustard, sugar, salt, and pepper in a bowl. Combine potatoes, bacon, and onion with the dressing. Serve warm or chilled.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Keftedes",
    "content": "Keftedes - Ingredients: 1/2 pound ground beef, 1/2 pound ground pork, 1 small onion, 2 cloves garlic, 1/4 cup breadcrumbs, 1 egg, 1 teaspoon oregano, 1 teaspoon mint, 1 teaspoon salt, 1/2 teaspoon pepper, Oil for frying Instructions: Mix ground beef, ground pork, diced onion, minced garlic, breadcrumbs, beaten egg, oregano, mint, salt, and pepper in a bowl. Form mixture into meatballs. Heat oil in a pan and fry meatballs until golden. Drain on paper towels and serve warm.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Kibbeh",
    "content": "Kibbeh - Ingredients: 1 cup bulgur, 1/2 pound ground beef, 1 small onion, 1/4 cup pine nuts, 1 teaspoon cumin, 1 teaspoon allspice, 1 teaspoon salt, Oil for frying Instructions: Soak bulgur in water until tender, then drain. Mix bulgur with ground beef, diced onion, pine nuts, cumin, allspice, and salt. Form mixture into balls or patties. Fry in hot oil until golden. Drain on paper towels and serve.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Kimchi",
    "content": "Kimchi - Ingredients: 1 napa cabbage, 1/4 cup sea salt, 1 tablespoon sugar, 2 tablespoons fish sauce, 2 tablespoons gochugaru (Korean chili powder), 4 cloves garlic, 1 inch ginger, 4 green onions Instructions: Cut cabbage into quarters and soak in salted water for 2 hours. Rinse and drain cabbage. Mix sugar, fish sauce, gochugaru, minced garlic, grated ginger, and chopped green onions in a bowl. Rub mixture onto cabbage leaves. Pack cabbage into a jar and let ferment at room temperature for 2-3 days. Store in the refrigerator and serve as needed.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Kongnamul Muchim",
    "content": "Kongnamul Muchim - Ingredients: 1 pound soybean sprouts, 2 cloves garlic, 2 tablespoons soy sauce, 1 tablespoon sesame oil, 1 tablespoon sesame seeds Instructions: Blanch soybean sprouts in boiling water for 2 minutes, then drain. Mix minced garlic, soy sauce, sesame oil, and sesame seeds in a bowl. Toss sprouts with the dressing. Serve chilled.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Labneh",
    "content": "Labneh - Ingredients: 2 cups yogurt, 1/2 teaspoon salt, 1/4 cup olive oil Instructions: Mix yogurt with salt. Place yogurt in a cheesecloth-lined strainer over a bowl. Let drain in the refrigerator for 24 hours. Transfer labneh to a serving dish and drizzle with olive oil. Serve with pita bread.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Larb",
    "content": "Larb - Ingredients: 1/2 pound ground chicken, 1 small onion, 2 cloves garlic, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon sugar, 1 tablespoon rice powder, 1/4 cup mint, 1/4 cup cilantro, 1-2 Thai chilies Instructions: Sauté ground chicken, diced onion, and minced garlic until cooked. Mix fish sauce, lime juice, sugar, and rice powder in a bowl. Toss chicken with the dressing, chopped mint, cilantro, and sliced chilies. Serve with lettuce leaves.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Lo Mein",
    "content": "Lo Mein - Ingredients: 8 ounces lo mein noodles, 1 cup sliced bell peppers, 1 cup snow peas, 1 small onion, 2 cloves garlic, 2 tablespoons soy sauce, 1 tablespoon oyster sauce, 1 tablespoon sesame oil Instructions: Cook lo mein noodles according to package instructions, then drain. Sauté diced onion and minced garlic in sesame oil until fragrant. Add bell peppers and snow peas, stir-fry until tender. Add cooked noodles, soy sauce, and oyster sauce, stir to combine. Serve warm.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Loubia",
    "content": "Loubia - Ingredients: 2 cups white beans, 1 small onion, 2 cloves garlic, 4 tomatoes, 1/4 cup olive oil, 1 teaspoon cumin, 1 teaspoon paprika, 1 teaspoon salt, 1/4 cup cilantro Instructions: Soak beans overnight, then cook until tender. Sauté diced onion and minced garlic in olive oil until softened. Add diced tomatoes, cumin, paprika, and salt, simmer for 10 minutes. Mix beans with tomato sauce and cook for 10 minutes. Stir in chopped cilantro and serve warm.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Macaroni and Cheese",
    "content": "Macaroni and Cheese - Ingredients: 2 cups elbow macaroni, 2 cups milk, 2 tablespoons butter, 2 tablespoons flour, 2 cups shredded cheddar cheese, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Cook macaroni according to package instructions, then drain. Melt butter in a saucepan, stir in flour to make a roux. Gradually add milk, stirring constantly until thickened. Add cheese, salt, and pepper, stir until melted. Combine cheese sauce with macaroni. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Manakish",
    "content": "Manakish - Ingredients: 2 1/4 teaspoons active dry yeast, 1 teaspoon sugar, 1 cup warm water, 3 cups flour, 1 teaspoon salt, 1/4 cup olive oil, 1/4 cup za'atar Instructions: Dissolve yeast and sugar in warm water, let sit until foamy. Mix flour and salt in a bowl, then add yeast mixture and olive oil. Knead until smooth, then let rise until doubled. Divide dough into balls and roll out into circles. Spread za'atar mixed with olive oil on top. Bake at 400°F (200°C) for 10-12 minutes until golden. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Mandazi",
    "content": "Mandazi - Ingredients: 2 cups flour, 1/4 cup sugar, 1 tablespoon baking powder, 1/2 teaspoon salt, 1/4 cup coconut milk, 1/4 cup water, Oil for frying Instructions: Mix flour, sugar, baking powder, and salt in a bowl. Add coconut milk and water, stir until dough forms. Roll out dough and cut into triangles. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Mandu",
    "content": "Mandu - Ingredients: 1 package dumpling wrappers, 1/2 pound ground pork, 1/2 cup chopped cabbage, 1/4 cup chopped green onions, 2 cloves garlic, 1 tablespoon soy sauce, 1 teaspoon sesame oil, Oil for frying Instructions: Mix ground pork, cabbage, green onions, minced garlic, soy sauce, and sesame Place a spoonful of filling on each wrapper and fold to seal. Fry in hot oil until golden, then steam for 5 minutes. Serve with dipping sauce.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Mango Sticky Rice",
    "content": "Mango Sticky Rice - Ingredients: 1 cup glutinous rice, 1 cup coconut milk, 1/4 cup sugar, 1/4 teaspoon salt, 2 mangoes Instructions: Rinse rice and soak in water for 1 hour. Steam rice until tender. Heat coconut milk with sugar and salt until dissolved. Mix coconut milk with cooked rice and let sit for 10 minutes. Serve rice with sliced mangoes.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Mapo Tofu",
    "content": "Mapo Tofu - Ingredients: 1 block tofu, 1/2 pound ground pork, 1 small onion, 2 cloves garlic, 1 tablespoon chili bean paste, 2 tablespoons soy sauce, 1 tablespoon rice wine, 1 teaspoon sugar, 1/4 cup chicken broth, 1 tablespoon cornstarch, 1/4 cup chopped green onions Instructions: Cut tofu into cubes and set aside. Sauté ground pork, diced onion, and minced garlic until browned. Add chili bean paste, soy sauce, rice wine, and sugar, cook for 2 minutes. Add chicken broth and tofu, simmer for 5 minutes. Mix cornstarch with water and add to the pan, stirring until thickened. Garnish with chopped green onions and serve.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Mashed Potatoes",
    "content": "Mashed Potatoes - Ingredients: 4 potatoes, 1/2 cup milk, 1/4 cup butter, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Peel and dice potatoes. Boil potatoes until tender, then drain. Mash potatoes with milk, butter, salt, and pepper. Serve warm.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Minestrone",
    "content": "Minestrone - Ingredients: 1 onion, 2 carrots, 2 celery stalks, 2 cloves garlic, 1 zucchini, 1 can diced tomatoes, 4 cups vegetable broth, 1 can cannellini beans, 1 cup pasta, 1/4 cup basil, 1/4 cup Parmesan cheese Instructions: Sauté diced onion, carrots, celery, and minced garlic until softened. Add diced zucchini, tomatoes, and broth. Bring to a boil, then simmer for 20 minutes. Add beans and pasta, cook until pasta is tender. Stir in chopped basil and serve with grated Parmesan cheese.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Miso Soup",
    "content": "Miso Soup - Ingredients: 4 cups dashi broth, 1/4 cup miso paste, 1/2 cup tofu, 1/4 cup green onions, 1/4 cup seaweed Instructions: Heat dashi broth until warm. Dissolve miso paste in a small amount of broth, then add to the pot. Add diced tofu and seaweed. Simmer for 5 minutes. Garnish with sliced green onions and serve.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Moqueca de Banana",
    "content": "Moqueca de Banana - Ingredients: 4 bananas, 1 small onion, 2 cloves garlic, 1 bell pepper, 2 tomatoes, 1 cup coconut milk, 1/4 cup cilantro, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Sauté diced onion, minced garlic, and sliced bell pepper until softened. Add diced tomatoes and cook for 5 minutes. Stir in coconut milk, sliced bananas, salt, and pepper. Simmer for 10 minutes. Garnish with chopped cilantro and serve warm.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Msemen",
    "content": "Msemen - Ingredients: 2 cups flour, 1 cup semolina, 1 teaspoon salt, 1/4 cup olive oil, 1 cup water, 1/4 cup butter Instructions: Mix flour, semolina, and salt in a bowl. Add water and knead until smooth. Divide dough into balls and roll out into thin circles. Brush with melted butter and fold into squares. Cook on a hot griddle until golden on both sides. Serve warm.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Muhammara",
    "content": "Muhammara - Ingredients: 2 red bell peppers, 1/2 cup walnuts, 1/4 cup breadcrumbs, 2 cloves garlic, 1/4 cup olive oil, 1 tablespoon pomegranate molasses, 1 teaspoon cumin, 1 teaspoon salt Instructions: Roast bell peppers until charred, then peel and seed. Blend peppers, walnuts, breadcrumbs, minced garlic, olive oil, pomegranate molasses, cumin, and salt in a food processor until smooth. Serve with pita bread.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Mutabal",
    "content": "Mutabal - Ingredients: 2 eggplants, 1/4 cup tahini, 1/4 cup lemon juice, 2 cloves garlic, 1/4 cup olive oil, 1 teaspoon salt Instructions: Roast eggplants until soft, then peel and mash. Blend mashed eggplant, tahini, lemon juice, minced garlic, and salt in a food processor. Slowly add olive oil while blending until smooth. Serve with a drizzle of olive oil.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Naan",
    "content": "Naan - Ingredients: 2 1/4 teaspoons active dry yeast, 1 teaspoon sugar, 1/2 cup warm water, 2 1/2 cups flour, 1/2 cup yogurt, 1/4 cup melted butter, 1 teaspoon salt Instructions: Dissolve yeast and sugar in warm water, let sit until foamy. Mix flour and salt in a bowl, then add yeast mixture, yogurt, and melted butter. Knead until smooth, then let rise until doubled. Divide dough into balls and roll out into circles. Cook on a hot griddle until bubbles form, then flip and cook the other side. Brush with melted butter and serve warm.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Nom Du Du (Green Papaya Salad)",
    "content": "Nom Du Du (Green Papaya Salad) - Ingredients: 1 green papaya, 2 carrots, 1/4 cup peanuts, 1/4 cup cilantro, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon sugar, 1-2 Thai chilies Instructions: Peel and shred green papaya and carrots. Crush peanuts and chop cilantro. Mix fish sauce, lime juice, sugar, and sliced chilies in a bowl. Toss shredded papaya, carrots, peanuts, and cilantro with the dressing. Serve chilled.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Nuoc Cham",
    "content": "Nuoc Cham - Ingredients: 1/4 cup fish sauce, 1/4 cup lime juice, 2 tablespoons sugar, 2 cloves garlic, 1-2 Thai chilies, 1/4 cup water Instructions: Mix fish sauce, lime juice, sugar, minced garlic, and sliced chilies in a bowl. Add water and stir until sugar is dissolved. Serve as a dipping sauce.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Oi Muchim",
    "content": "Oi Muchim - Ingredients: 2 cucumbers, 2 cloves garlic, 2 tablespoons soy sauce, 1 tablespoon sesame oil, 1 tablespoon gochugaru (Korean chili powder), 1 tablespoon sesame seeds Instructions: Slice cucumbers thinly. Mix minced garlic, soy sauce, sesame oil, gochugaru, and sesame seeds in a bowl. Toss cucumbers with the dressing. Serve chilled.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Onigiri (Rice Balls)",
    "content": "Onigiri (Rice Balls) - Ingredients: 2 cups cooked sushi rice, 1/4 cup filling (salmon, pickled plum), 1 sheet nori (seaweed) Instructions: Wet hands and shape rice into balls or triangles. Make a small indentation and add filling. Wrap with a strip of nori. Serve immediately.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Pão de Queijo",
    "content": "Pão de Queijo - Ingredients: 2 cups tapioca flour, 1 cup milk, 1/2 cup butter, 1 teaspoon salt, 1 cup grated Parmesan cheese, 2 eggs Instructions: Preheat oven to 375°F (190°C). Heat milk, butter, and salt in a saucepan until boiling. Remove from heat and stir in tapioca flour until smooth. Let cool slightly, then mix in grated cheese and beaten eggs. Form dough into balls and place on a baking sheet. Bake for 20-25 minutes until golden. Serve warm.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Pad See Ew",
    "content": "Pad See Ew - Ingredients: 8 ounces wide rice noodles, 1/2 pound chicken breast, 1 cup broccoli, 2 eggs, 2 tablespoons soy sauce, 2 tablespoons oyster sauce, 1 tablespoon sugar, 1 tablespoon vegetable oil Instructions: Soak rice noodles in warm water until softened, then drain. Sauté sliced chicken in vegetable oil until cooked, then set aside. Scramble eggs in the same pan. Add noodles, soy sauce, oyster sauce, and sugar, stir to combine. Add broccoli and cooked chicken, stir-fry until heated through. Serve warm.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_3.pdf",
    "title": "Pad Thai",
    "content": "Pad Thai - Ingredients: 8 ounces rice noodles, 1/2 pound shrimp, 2 eggs, 1 cup bean sprouts, 1/4 cup peanuts, 2 tablespoons fish sauce, 2 tablespoons tamarind paste, 1 tablespoon sugar, 1 tablespoon lime juice, 1/4 cup green onions Instructions: Soak rice noodles in warm water until softened, then drain. Sauté shrimp in a pan until cooked, then set aside.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pajeon (Pancakes)",
    "content": "Pajeon (Pancakes) - Ingredients: 1 cup flour, 1 cup water, 1 egg, 1/2 cup green onions, 1/2 cup seafood (optional), 1 tablespoon soy sauce, 1 tablespoon sesame oil Instructions: Mix flour, water, and beaten egg in a bowl. Add chopped green onions and seafood (if using). Heat sesame oil in a pan and pour in batter. Cook until golden on both sides. Serve with soy sauce for dipping.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pan con Tomate",
    "content": "Pan con Tomate - Ingredients: 1 baguette, 4 tomatoes, 2 cloves garlic, 1/4 cup olive oil, 1 teaspoon salt Instructions: Slice baguette and toast until golden. Rub toasted bread with cut garlic cloves. Grate tomatoes and spread on bread. Drizzle with olive oil and sprinkle with salt. Serve immediately.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Paneer Tikka",
    "content": "Paneer Tikka - Ingredients: 1 pound paneer, 1/2 cup yogurt, 1 tablespoon lemon juice, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon garam masala, 1 teaspoon turmeric, 1 teaspoon salt, Skewers Instructions: Cut paneer into cubes. Mix yogurt, lemon juice, cumin, coriander, garam masala, turmeric, and salt in a bowl. Add paneer cubes and marinate for at least 1 hour. Thread paneer onto skewers. Grill or broil until golden, turning occasionally. Serve warm.",
    "page": 1
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Panzanella",
    "content": "Panzanella - Ingredients: 4 cups cubed bread, 4 tomatoes, 1 cucumber, 1 small red onion, 1/4 cup basil, 1/4 cup olive oil, 2 tablespoons red wine vinegar, 1 teaspoon salt Instructions: Toast bread cubes until golden. Dice tomatoes and cucumber, slice red onion. Mix bread, tomatoes, cucumber, onion, and chopped basil. Whisk olive oil, vinegar, and salt, then pour over salad. Toss well and serve.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Papadum",
    "content": "Papadum - Ingredients: 1 cup urad dal flour, 1/4 cup water, 1/2 teaspoon salt, Oil for frying Instructions: Mix urad dal flour, water, and salt to form a dough. Roll dough into thin circles. Fry in hot oil until crispy. Drain on paper towels and serve.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Patatas Bravas",
    "content": "Patatas Bravas - Ingredients: 4 potatoes, 1/4 cup olive oil, 1/2 cup tomato sauce, 1 teaspoon paprika, 1/2 teaspoon cayenne pepper, 1/2 teaspoon salt, 1/4 cup mayonnaise Instructions: Peel and dice potatoes. Toss potatoes with olive oil and salt, then roast at 400°F (200°C) until crispy. Mix tomato sauce, paprika, and cayenne pepper in a bowl. Serve potatoes with tomato sauce and a dollop of mayonnaise.",
    "page": 2
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pepper Pot",
    "content": "Pepper Pot - Ingredients: 1 pound beef, 1 small onion, 2 cloves garlic, 4 cups beef broth, 1 cup spinach, 1 cup okra, 1 teaspoon thyme, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Sauté diced beef, onion, and minced garlic until browned. Add beef broth, thyme, salt, and pepper, simmer for 1 hour. Stir in spinach and okra, cook until tender. Serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Peri-Peri Chicken",
    "content": "Peri-Peri Chicken - Ingredients: 1 pound chicken thighs, 1/4 cup peri-peri sauce, 2 tablespoons olive oil, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Marinate chicken in peri-peri sauce, olive oil, salt, and pepper for at least 1 hour. Preheat oven to 400°F (200°C). Arrange chicken on a baking sheet and roast for 25-30 minutes until cooked through. Serve warm.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pico de Gallo",
    "content": "Pico de Gallo - Ingredients: 4 tomatoes, 1 small onion, 1 jalapeño, 1/4 cup cilantro, 1 lime, 1 teaspoon salt Instructions: Dice tomatoes, onion, and jalapeño. Chop cilantro. Combine all ingredients in a bowl. Squeeze lime juice over the mixture and add salt. Mix well and serve.",
    "page": 3
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pimientos de Padrón",
    "content": "Pimientos de Padrón - Ingredients: 1 pound Padrón peppers, 2 tablespoons olive oil, 1 teaspoon sea salt Instructions: Heat olive oil in a pan. Add Padrón peppers and sauté until blistered and tender. Sprinkle with sea salt and serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Plantain Chips",
    "content": "Plantain Chips - Ingredients: 2 green plantains, 1 cup vegetable oil, 1 teaspoon salt Instructions: Peel and slice plantains thinly. Heat oil in a pan and fry plantain slices until crispy. Drain on paper towels and sprinkle with salt. Serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Polenta",
    "content": "Polenta - Ingredients: 1 cup cornmeal, 4 cups water, 1 teaspoon salt, 2 tablespoons butter, 1/2 cup grated Parmesan cheese Instructions: Bring water and salt to a boil. Gradually whisk in cornmeal. Reduce heat and cook, stirring constantly, until thickened (about 30 minutes). Stir in butter and Parmesan cheese. Serve warm.",
    "page": 4
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Potato Salad",
    "content": "Potato Salad - Ingredients: 4 potatoes, 2 eggs, 1 small onion, 1/2 cup mayonnaise, 2 tablespoons mustard, 1 tablespoon vinegar, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Boil potatoes until tender, then dice. Hard-boil eggs, then chop. Mix potatoes, eggs, diced onion, mayonnaise, mustard, vinegar, salt, and pepper. Chill for at least 1 hour before serving.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pretzels",
    "content": "Pretzels - Ingredients: 2 1/4 teaspoons active dry yeast, 1 teaspoon sugar, 1 cup warm water, 3 cups flour, 1 teaspoon salt, 1/4 cup baking soda, 1 egg, Coarse salt Instructions: Dissolve yeast and sugar in warm water, let sit until foamy. Mix flour and salt in a bowl, then add yeast mixture. Knead until smooth, then let rise until doubled. Divide dough into pieces and roll into ropes, then shape into pretzels. Boil water with baking soda and dip pretzels in the solution. Place on a baking sheet, brush with beaten egg, and sprinkle with coarse salt. Bake at 450°F (230°C) for 12-15 minutes until golden. Serve warm.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Pulao",
    "content": "Pulao - Ingredients: 1 cup basmati rice, 2 cups water, 1 small onion, 1 carrot, 1/2 cup peas, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon turmeric, 1 teaspoon garam masala, 1 teaspoon salt, 2 tablespoons oil Instructions: Rinse rice and soak in water for 30 minutes. Heat oil in a pan and sauté diced onion until translucent. Add diced carrot, peas, cumin, coriander, turmeric, and garam masala, cook for 1 minute. Drain rice and add to the pan, stir to coat with spices. Add water and bring to a boil. Reduce heat, cover, and simmer until rice is tender and water is absorbed. Add salt to taste and serve.",
    "page": 5
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Quesadillas",
    "content": "Quesadillas - Ingredients: 4 flour tortillas, 2 cups shredded cheese, 1/2 cup diced cooked chicken (optional), 1/4 cup chopped cilantro, 1 tablespoon vegetable oil Instructions: Heat oil in a pan. Place a tortilla in the pan and sprinkle with cheese, chicken, and cilantro. Top with another tortilla. Cook until cheese is melted and tortilla is golden, then flip and cook the other side. Cut into wedges and serve.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Quiche Lorraine",
    "content": "Quiche Lorraine - Ingredients: 1 pie crust, 6 slices bacon, 1 small onion, 1 cup grated Gruyère cheese, 3 eggs, 1 cup heavy cream, 1/2 teaspoon salt, 1/4 teaspoon pepper Instructions: Preheat oven to 375°F (190°C). Cook bacon until crispy, then crumble. Sauté diced onion in bacon fat until softened. Place pie crust in a pie dish and sprinkle with bacon, onion, and cheese. Beat eggs with cream, salt, and pepper, then pour over the filling. Bake for 30-35 minutes until set and golden. Serve warm.",
    "page": 6
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Quindim",
    "content": "Quindim - Ingredients: 2 cups sugar, 1 cup coconut, 1/4 cup butter, 10 egg yolks, 1 teaspoon vanilla extract Instructions: Preheat oven to 350°F (175°C). Mix sugar, coconut, melted butter, egg yolks, and vanilla extract in a bowl. Pour mixture into greased muffin tins. Bake for 30-35 minutes until set and golden. Let cool before removing from tins. Serve chilled.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Raita",
    "content": "Raita - Ingredients: 1 cup yogurt, 1/2 cucumber, 1/4 cup mint, 1/4 teaspoon cumin, 1/4 teaspoon salt Instructions: Grate cucumber and squeeze out excess moisture. Mix yogurt with cucumber, chopped mint, cumin, and salt. Serve chilled.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Ratatouille",
    "content": "Ratatouille - Ingredients: 1 eggplant, 1 zucchini, 1 bell pepper, 1 small onion, 2 cloves garlic, 4 tomatoes, 1 teaspoon thyme, 1 teaspoon rosemary, 1/4 cup olive oil, 1 teaspoon salt Instructions: Dice eggplant, zucchini, bell pepper, and tomatoes. Sauté diced onion and minced garlic in olive oil until softened. Add eggplant, zucchini, bell pepper, tomatoes, thyme, rosemary, and salt. Simmer for 30 minutes, stirring occasionally. Serve warm.",
    "page": 7
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Rau Muong Xao Toi (Stir-Fried Morning Glory with Garlic)",
    "content": "Rau Muong Xao Toi (Stir-Fried Morning Glory with Garlic) - Ingredients: 1 pound morning glory, 4 cloves garlic, 2 tablespoons fish sauce, 1 tablespoon vegetable oil Instructions: Sauté minced garlic in vegetable oil until fragrant. Add morning glory and stir-fry until tender. Add fish sauce and cook for 2 minutes. Serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Refried Beans",
    "content": "Refried Beans - Ingredients: 2 cups cooked pinto beans, 1/4 cup lard or vegetable oil, 1 small onion, 1 clove garlic, 1 teaspoon salt Instructions: Heat lard or oil in a pan and sauté diced onion and minced garlic until translucent. Add beans and mash with a potato masher. Cook, stirring frequently, until beans are thickened. Add salt to taste and serve.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Rfissa",
    "content": "Rfissa - Ingredients: 1 pound chicken, 1 small onion, 2 cloves garlic, 1 teaspoon cumin, 1 teaspoon turmeric, 1 teaspoon ginger, 1 teaspoon salt, 1/4 cup olive oil, 4 cups chicken broth, 1/4 cup lentils, 1/4 cup cilantro, 4 pieces flatbread Instructions: Sauté chicken, diced onion, and minced garlic in olive oil until browned. Add cumin, turmeric, ginger, and salt, cook for 1 minute. Add chicken broth and lentils, simmer until chicken is cooked and lentils are tender. Stir in chopped cilantro. Tear flatbread into pieces and place in a serving dish. Pour chicken and sauce over the bread and serve warm.",
    "page": 8
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Rice and Peas",
    "content": "Rice and Peas - Ingredients: 1 cup rice, 1 cup coconut milk, 1 cup water, 1/2 cup kidney beans, 1 small onion, 2 cloves garlic, 1 teaspoon thyme, 1 teaspoon salt Instructions: Sauté diced onion and minced garlic until softened. Add rice, coconut milk, water, kidney beans, thyme, and salt. Bring to a boil, then reduce heat and simmer until rice is tender. Serve warm.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Rillettes",
    "content": "Rillettes - Ingredients: 1 pound pork shoulder, 1/2 cup duck fat, 1/4 cup white wine, 1 teaspoon thyme, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Cut pork into small pieces. Cook pork with duck fat, wine, thyme, salt, and pepper in a pot over low heat until very tender (about 3 hours). Shred pork with a fork and pack into jars. Chill until set. Serve with bread.",
    "page": 9
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Risotto",
    "content": "Risotto - Ingredients: 1 cup Arborio rice, 4 cups chicken broth, 1/2 cup white wine, 1 small onion, 2 cloves garlic, 1/2 cup Parmesan cheese, 2 tablespoons butter, 1 tablespoon olive oil Instructions: Heat broth in a pot and keep warm. Sauté diced onion and minced garlic in olive oil until translucent. Add rice and cook until lightly toasted. Pour in wine and cook until absorbed. Add broth one ladle at a time, stirring constantly until absorbed. Continue until rice is creamy and tender. Stir in butter and grated Parmesan cheese. Serve immediately.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Rösti (Potato Pancakes)",
    "content": "Rösti (Potato Pancakes) - Ingredients: 4 potatoes, 1 small onion, 1/4 cup flour, 1 egg, 1 teaspoon salt, 1/2 teaspoon pepper, Oil for frying Instructions: Grate potatoes and onion, then squeeze out excess moisture. Mix with flour, beaten egg, salt, and pepper. Form mixture into patties. Fry in hot oil until golden on both sides. Drain on paper towels and serve warm.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Rotkohl (Braised Red Cabbage)",
    "content": "Rotkohl (Braised Red Cabbage) - Ingredients: 1 head red cabbage, 1 small onion, 1 apple, 1/4 cup vinegar, 1/4 cup sugar, 1/4 cup water, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Shred cabbage and slice onion and apple. Sauté onion in a pot until softened. Add cabbage, apple, vinegar, sugar, water, salt, and pepper. Simmer for 45 minutes until cabbage is tender. Serve warm.",
    "page": 10
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Saganaki",
    "content": "Saganaki - Ingredients: 1/2 pound kefalotyri cheese, 1/4 cup flour, 1/4 cup olive oil, 1 lemon Instructions: Cut cheese into slices. Dredge cheese in flour. Heat olive oil in a pan and fry cheese until golden on both sides. Squeeze lemon juice over the top and serve immediately.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Salade Niçoise",
    "content": "Salade Niçoise - Ingredients: 4 tomatoes, 1 cucumber, 1 small red onion, 1/4 cup olives, 1/4 cup green beans, 2 hard-boiled eggs, 1 can tuna, 1/4 cup olive oil, 2 tablespoons red wine vinegar, 1 teaspoon Dijon mustard, 1 teaspoon salt Instructions: Dice tomatoes and cucumber, slice red onion. Blanch green beans until tender. Arrange tomatoes, cucumber, onion, green beans, olives, and tuna on a plate. Quarter hard-boiled eggs and add to the salad. Whisk olive oil, vinegar, mustard, and salt, then drizzle over the salad. Toss gently and serve.",
    "page": 11
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Salpicão",
    "content": "Salpicão - Ingredients: 2 cups shredded chicken, 1 small onion, 1 carrot, 1 apple, 1/4 cup raisins, 1/4 cup mayonnaise, 1/4 cup parsley, 1 teaspoon salt Instructions: Dice onion, grate carrot, and chop apple. Mix shredded chicken with onion, carrot, apple, raisins, mayonnaise, chopped parsley, and salt. Serve chilled.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Saltfish Fritters",
    "content": "Saltfish Fritters - Ingredients: 1 pound salted cod, 1 small onion, 2 cloves garlic, 1/2 cup flour, 1/4 cup water, 1 teaspoon thyme, 1 teaspoon salt, Oil for frying Instructions: Soak salted cod in water overnight, then rinse and flake. Mix cod with diced onion, minced garlic, flour, water, thyme, and salt. Form mixture into fritters. Fry in hot oil until golden. Drain on paper towels and serve warm.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Samosa",
    "content": "Samosa - Ingredients: 2 cups flour, 1/4 cup oil, 1/2 cup water, 2 potatoes, 1/2 cup peas, 1 small onion, 1 teaspoon cumin, 1 teaspoon coriander, 1 teaspoon garam masala, 1 teaspoon salt, Oil for frying Instructions: Mix flour, oil, and water to form a dough, then let rest. Boil and mash potatoes, then mix with peas, diced onion, and spices. Roll dough into circles, cut in half, and form cones. Fill cones with potato mixture and seal edges. Fry in hot oil until golden. Serve warm.",
    "page": 12
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Satay",
    "content": "Satay - Ingredients: 1 pound chicken breast, 1/4 cup coconut milk, 2 tablespoons soy sauce, 2 tablespoons peanut butter, 1 tablespoon curry powder, 1 tablespoon brown sugar, Skewers Instructions: Cut chicken into strips and thread onto skewers. Mix coconut milk, soy sauce, peanut butter, curry powder, and brown sugar in a bowl. Marinate chicken in the mixture for at least 1 hour. Grill or broil until cooked through. Serve with peanut sauce.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Sauerkraut",
    "content": "Sauerkraut - Ingredients: 1 head cabbage, 1 tablespoon sea salt, 1 teaspoon caraway seeds Instructions: Shred cabbage and mix with sea salt and caraway seeds. Pack cabbage into a jar and press down to release juices. Cover and let ferment at room temperature for 1-2 weeks. Store in the refrigerator and serve as needed.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Shakshuka",
    "content": "Shakshuka - Ingredients: 1 small onion, 2 cloves garlic, 1 bell pepper, 4 tomatoes, 1 teaspoon cumin, 1 teaspoon paprika, 1 teaspoon salt, 4 eggs, 1/4 cup parsley Instructions: Sauté diced onion, minced garlic, and diced bell pepper until softened. Add diced tomatoes, cumin, paprika, and salt, simmer for 10 minutes. Make wells in the sauce and crack eggs into each well. Cover and cook until eggs are set. Garnish with chopped parsley and serve.",
    "page": 13
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Shawarma",
    "content": "Shawarma - Ingredients: 1 pound chicken thighs, 1/4 cup yogurt, 2 tablespoons lemon juice, 2 cloves garlic, 1 teaspoon cumin, 1 teaspoon paprika, 1 teaspoon turmeric, 1 teaspoon salt, 1/2 teaspoon pepper Instructions: Mix yogurt, lemon juice, minced garlic, cumin, paprika, turmeric, salt, and pepper in a bowl. Marinate chicken in the mixture for at least 2 hours. Preheat oven to 400°F (200°C). Arrange chicken on a baking sheet and roast for 25-30 minutes until cooked through. Slice and serve with pita bread and toppings.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Skordalia",
    "content": "Skordalia - Ingredients: 4 potatoes, 4 cloves garlic, 1/4 cup olive oil, 1/4 cup lemon juice, 1 teaspoon salt Instructions: Boil potatoes until tender, then mash. Blend mashed potatoes with minced garlic, olive oil, lemon juice, and salt until smooth. Serve as a dip or side dish.",
    "page": 14
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Som Tum (Green Papaya Salad)",
    "content": "Som Tum (Green Papaya Salad) - Ingredients: 1 green papaya, 2 tomatoes, 1 carrot, 2 cloves garlic, 2 tablespoons fish sauce, 2 tablespoons lime juice, 1 tablespoon sugar, 1 tablespoon peanuts, 1-2 Thai chilies Instructions: Peel and shred green papaya and carrot. Crush garlic and chilies in a mortar and pestle. Add fish sauce, lime juice, and sugar, mix well. Toss shredded papaya, carrot, and sliced tomatoes with the dressing. Garnish with crushed peanuts and serve.",
    "page": 15
  },
  {
    "document": "Dinner Ideas - Sides_4.pdf",
    "title": "Sopa de Tortilla",
    "content": "Sopa de Tortilla - Ingredients: 4 corn tortillas, 1 tablespoon vegetable oil, 1 small onion, 2 cloves garlic, 4 cups chicken broth, 2 tomatoes, 1 teaspoon cumin, 1 avocado, 1/4 cup cilantro Instructions: Cut tortillas into strips and fry in oil until crispy. Sauté diced onion and minced garlic in a pot until translucent. Add diced tomatoes and cumin, cook for 5 minutes. Pour in chicken broth and bring to a boil. Simmer for 10 minutes. Serve soup topped with tortilla strips, diced avocado, and chopped cilantro.",
    "page": 15
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken Caesar Wrap",
    "content": "Chicken Caesar Wrap - Ingredients: 1 whole wheat tortilla, 1 cup cooked chicken breast, sliced, 1 cup romaine lettuce, chopped, 2 tablespoons Caesar dressing, 2 tablespoons grated Parmesan cheese, Optional: croutons for extra crunch Instructions: Lay the tortilla flat and spread the Caesar dressing evenly. Add the chicken, lettuce, and Parmesan cheese. Roll up the tortilla tightly and slice in half.",
    "page": 2
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Quinoa Salad",
    "content": "Quinoa Salad - Ingredients: 1 cup cooked quinoa, 1/2 cup cherry tomatoes, halved, 1/2 cucumber, diced, 1/4 cup red onion, finely chopped, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a large bowl, combine the quinoa, tomatoes, cucumber, red onion, and feta cheese. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 2
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Turkey and Avocado Sandwich",
    "content": "Turkey and Avocado Sandwich - Ingredients: 2 slices whole grain bread, 4 slices turkey breast, 1/2 avocado, sliced, 1/2 cup spinach leaves, 1 tablespoon mustard or mayo Instructions: Spread mustard or mayo on one slice of bread. Layer the turkey, avocado, and spinach on top. Top with the second slice of bread and cut in half.",
    "page": 2
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Greek Yogurt Parfait",
    "content": "Greek Yogurt Parfait - Ingredients: 1 cup Greek yogurt, 1/2 cup granola, 1/2 cup mixed berries (strawberries, blueberries, raspberries), 1 tablespoon honey Instructions: In a bowl or jar, layer the Greek yogurt, granola, and mixed berries. Drizzle with honey. Repeat the layers if desired.",
    "page": 3
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Hummus and Veggie Pita",
    "content": "Hummus and Veggie Pita - Ingredients: 1 whole wheat pita bread, 1/2 cup hummus, 1/2 cup cucumber, sliced, 1/2 cup bell pepper, sliced, 1/4 cup shredded carrots, 1/4 cup baby spinach Instructions: Cut the pita bread in half to create pockets. Spread hummus inside each pocket. Fill with cucumber, bell pepper, carrots, and spinach.",
    "page": 3
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Tuna Salad",
    "content": "Tuna Salad - Ingredients: 1 can tuna, drained, 1/4 cup mayonnaise, 1 tablespoon Dijon mustard, 1 celery stalk, diced, 1/4 cup red onion, finely chopped, Salt and pepper to taste, Lettuce leaves or whole grain bread for serving Instructions: In a bowl, combine the tuna, mayonnaise, Dijon mustard, celery, and red onion. Season with salt and pepper. Serve on lettuce leaves or whole grain bread.",
    "page": 3
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Caprese Sandwich",
    "content": "Caprese Sandwich - Ingredients: 2 slices ciabatta bread, 1/2 cup fresh mozzarella, sliced, 1 tomato, sliced, Fresh basil leaves, 1 tablespoon balsamic glaze, 1 tablespoon olive oil, Salt and pepper to taste Instructions: Drizzle olive oil on one slice of bread. Layer the mozzarella, tomato, and basil on top. Drizzle with balsamic glaze and season with salt and pepper. Top with the second slice of bread and cut in half.",
    "page": 4
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken Salad Lettuce Wraps",
    "content": "Chicken Salad Lettuce Wraps - Ingredients: 1 cup cooked chicken breast, shredded, 1/4 cup mayonnaise, 1 tablespoon Dijon mustard, 1 celery stalk, diced, 1/4 cup red grapes, halved, Salt and pepper to taste, Lettuce leaves for serving Instructions: In a bowl, combine the chicken, mayonnaise, Dijon mustard, celery, and grapes. Season with salt and pepper. Serve in lettuce leaves.",
    "page": 4
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Veggie and Hummus Wrap",
    "content": "Veggie and Hummus Wrap - Ingredients: 1 whole wheat tortilla, 1/2 cup hummus, 1/2 cup cucumber, sliced, 1/2 cup bell pepper, sliced, 1/4 cup shredded carrots, 1/4 cup baby spinach Instructions: Lay the tortilla flat and spread the hummus evenly. Add the cucumber, bell pepper, carrots, and spinach. Roll up the tortilla tightly and slice in half.",
    "page": 4
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Egg Salad Sandwich",
    "content": "Egg Salad Sandwich - Ingredients: 4 hard-boiled eggs, chopped, 1/4 cup mayonnaise, 1 tablespoon Dijon mustard, 1 celery stalk, diced, Salt and pepper to taste, 2 slices whole grain bread Instructions: In a bowl, combine the eggs, mayonnaise, Dijon mustard, and celery. Season with salt and pepper. Spread on one slice of bread and top with the second slice.",
    "page": 5
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Pasta Salad",
    "content": "Pasta Salad - Ingredients: 2 cups cooked pasta (such as rotini or penne), 1/2 cup cherry tomatoes, halved, 1/2 cup cucumber, diced, 1/4 cup black olives, sliced, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon red wine vinegar, Salt and pepper to taste Instructions: In a large bowl, combine the pasta, tomatoes, cucumber, olives, and feta cheese. Drizzle with olive oil and red wine vinegar. Season with salt and pepper, then toss to combine.",
    "page": 5
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken and Avocado Salad",
    "content": "Chicken and Avocado Salad - Ingredients: 1 cup cooked chicken breast, diced, 1/2 avocado, diced, 1/4 cup cherry tomatoes, halved, 1/4 cup red onion, finely chopped, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a bowl, combine the chicken, avocado, tomatoes, and red onion. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 5
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Turkey and Cheese Roll-Ups",
    "content": "Turkey and Cheese Roll-Ups - Ingredients: 4 slices turkey breast, 4 slices cheese (such as cheddar or Swiss), 1/2 cup baby spinach, 1/4 cup hummus Instructions: Lay a slice of turkey flat and spread with hummus. Place a slice of cheese and a few spinach leaves on top. Roll up tightly and repeat with remaining ingredients.",
    "page": 6
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Mediterranean Chickpea Salad",
    "content": "Mediterranean Chickpea Salad - Ingredients: 1 can chickpeas, drained and rinsed, 1/2 cup cherry tomatoes, halved, 1/2 cucumber, diced, 1/4 cup red onion, finely chopped, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a large bowl, combine the chickpeas, tomatoes, cucumber, red onion, and feta cheese. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 6
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken and Veggie Stir-Fry",
    "content": "Chicken and Veggie Stir-Fry - Ingredients: 1 cup cooked chicken breast, sliced, 1/2 cup bell pepper, sliced, 1/2 cup broccoli florets, 1/4 cup snap peas, 2 tablespoons soy sauce, 1 tablespoon olive oil, 1 teaspoon sesame oil, Cooked rice for serving Instructions: In a large skillet, heat olive oil over medium heat. Add bell pepper, broccoli, and snap peas, and stir-fry until tender. Add the cooked chicken and soy sauce, and stir to combine. Drizzle with sesame oil and serve over rice.",
    "page": 7
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Shrimp and Avocado Salad",
    "content": "Shrimp and Avocado Salad - Ingredients: 1 cup cooked shrimp, peeled and deveined, 1/2 avocado, diced, 1/4 cup cherry tomatoes, halved, 1/4 cup red onion, finely chopped, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a bowl, combine the shrimp, avocado, tomatoes, and red onion. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 7
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Black Bean and Corn Salad",
    "content": "Black Bean and Corn Salad - Ingredients: 1 can black beans, drained and rinsed, 1 cup corn kernels (fresh or canned), 1/2 cup cherry tomatoes, halved, 1/4 cup red onion, finely chopped, 1/4 cup cilantro, chopped, 2 tablespoons olive oil, 1 tablespoon lime juice, Salt and pepper to taste Instructions: In a large bowl, combine the black beans, corn, tomatoes, red onion, and cilantro. Drizzle with olive oil and lime juice. Season with salt and pepper, then toss to combine.",
    "page": 7
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken and Pesto Sandwich",
    "content": "Chicken and Pesto Sandwich - Ingredients: 2 slices whole grain bread, 1 cup cooked chicken breast, sliced, 2 tablespoons pesto, 1/2 cup baby spinach, 1/4 cup roasted red peppers, sliced Instructions: Spread pesto on one slice of bread. Layer the chicken, spinach, and roasted red peppers on top. Top with the second slice of bread and cut in half.",
    "page": 8
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Lentil Salad",
    "content": "Lentil Salad - Ingredients: 1 cup cooked lentils, 1/2 cup cherry tomatoes, halved, 1/2 cucumber, diced, 1/4 cup red onion, finely chopped, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon red wine vinegar, Salt and pepper to taste Instructions: In a large bowl, combine the lentils, tomatoes, cucumber, red onion, and feta cheese. Drizzle with olive oil and red wine vinegar. Season with salt and pepper, then toss to combine.",
    "page": 8
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chickpea and Avocado Sandwich",
    "content": "Chickpea and Avocado Sandwich - Ingredients: 2 slices whole grain bread, 1/2 avocado, mashed, 1/2 cup chickpeas, mashed, 1/4 cup cherry tomatoes, halved, 1 tablespoon olive oil, Salt and pepper to taste Instructions: In a bowl, combine the mashed avocado and chickpeas. Spread the mixture on one slice of bread. Top with cherry tomatoes and drizzle with olive oil. Season with salt and pepper, then top with the second slice of bread.",
    "page": 9
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Greek Salad",
    "content": "Greek Salad - Ingredients: 1 cup cherry tomatoes, halved, 1/2 cucumber, diced, 1/4 cup red onion, finely chopped, 1/4 cup black olives, sliced, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon red wine vinegar, Salt and pepper to taste Instructions: In a large bowl, combine the tomatoes, cucumber, red onion, olives, and feta cheese. Drizzle with olive oil and red wine vinegar. Season with salt and pepper, then toss to combine.",
    "page": 9
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Turkey and Cranberry Wrap",
    "content": "Turkey and Cranberry Wrap - Ingredients: 1 whole wheat tortilla, 4 slices turkey breast, 2 tablespoons cranberry sauce, 1/2 cup baby spinach, 1/4 cup shredded carrots Instructions: Lay the tortilla flat and spread the cranberry sauce evenly. Add the turkey, spinach, and carrots. Roll up the tortilla tightly and slice in half.",
    "page": 9
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Caprese Salad",
    "content": "Caprese Salad - Ingredients: 1 cup cherry tomatoes, halved, 1/2 cup fresh mozzarella, diced, Fresh basil leaves, 2 tablespoons olive oil, 1 tablespoon balsamic glaze, Salt and pepper to taste Instructions: In a bowl, combine the tomatoes, mozzarella, and basil. Drizzle with olive oil and balsamic glaze. Season with salt and pepper, then toss to combine.",
    "page": 10
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken and Veggie Skewers",
    "content": "Chicken and Veggie Skewers - Ingredients: 1 cup cooked chicken breast, cubed, 1/2 cup bell pepper, cubed, 1/2 cup zucchini, sliced, 1/4 cup red onion, cubed, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: Thread the chicken, bell pepper, zucchini, and red onion onto skewers. Drizzle with olive oil and lemon juice. Season with salt and pepper. Serve cold or reheat before serving.",
    "page": 10
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Tuna and Avocado Salad",
    "content": "Tuna and Avocado Salad - Ingredients: 1 can tuna, drained, 1/2 avocado, diced, 1/4 cup cherry tomatoes, halved, 1/4 cup red onion, finely chopped, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a bowl, combine the tuna, avocado, tomatoes, and red onion. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 10
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Veggie Sushi Rolls",
    "content": "Veggie Sushi Rolls - Ingredients: 1 cup cooked sushi rice, 1/2 cucumber, julienned, 1/2 avocado, sliced, 1/4 cup carrot, julienned, 2 sheets nori (seaweed), Soy sauce for dipping Instructions: Lay a sheet of nori on a bamboo sushi mat. Spread a thin layer of sushi rice over the nori, leaving a 1-inch border at the top. Arrange the cucumber, avocado, and carrot in a line along the bottom edge of the rice. Roll the nori tightly using the bamboo mat. Slice into bite-sized pieces and serve with soy sauce. Spinach and Feta Stuﬀed Pita Ingredients: 1 whole wheat pita bread, 1/2 cup spinach, chopped, 1/4 cup feta cheese, crumbled, 1/4 cup cherry tomatoes, halved, 1 tablespoon olive oil, Salt and pepper to taste Instructions: Cut the pita bread in half to create pockets. In a bowl, combine the spinach, feta cheese, and cherry tomatoes. Drizzle with olive oil and season with salt and pepper. Stuﬀ the mixture into the pita pockets.",
    "page": 11
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "BBQ Chicken Wrap",
    "content": "BBQ Chicken Wrap - Ingredients: 1 whole wheat tortilla, 1 cup cooked chicken breast, shredded, 2 tablespoons BBQ sauce, 1/4 cup shredded cheese, 1/4 cup coleslaw mix Instructions: Lay the tortilla flat and spread the BBQ sauce evenly. Add the chicken, cheese, and coleslaw mix. Roll up the tortilla tightly and slice in half.",
    "page": 12
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Couscous Salad",
    "content": "Couscous Salad - Ingredients: 1 cup cooked couscous, 1/2 cup cherry tomatoes, halved, 1/2 cucumber, diced, 1/4 cup red onion, finely chopped, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a large bowl, combine the couscous, tomatoes, cucumber, red onion, and feta cheese. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 12
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Eggplant and Hummus Sandwich",
    "content": "Eggplant and Hummus Sandwich - Ingredients: 2 slices whole grain bread, 1/2 cup roasted eggplant slices, 1/4 cup hummus, 1/4 cup baby spinach, 1/4 cup roasted red peppers, sliced Instructions: Spread hummus on one slice of bread. Layer the roasted eggplant, spinach, and roasted red peppers on top. Top with the second slice of bread and cut in half.",
    "page": 12
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken and Mango Salad",
    "content": "Chicken and Mango Salad - Ingredients: 1 cup cooked chicken breast, diced, 1/2 mango, diced, 1/4 cup red onion, finely chopped, 1/4 cup cilantro, chopped, 2 tablespoons olive oil, 1 tablespoon lime juice, Salt and pepper to taste Instructions: In a bowl, combine the chicken, mango, red onion, and cilantro. Drizzle with olive oil and lime juice. Season with salt and pepper, then toss to combine.",
    "page": 13
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Veggie and Cheese Quesadilla",
    "content": "Veggie and Cheese Quesadilla - Ingredients: 1 whole wheat tortilla, 1/2 cup shredded cheese, 1/4 cup bell pepper, sliced, 1/4 cup zucchini, sliced, 1/4 cup red onion, sliced Instructions: Lay the tortilla flat and sprinkle half of the cheese on one side. Add the bell pepper, zucchini, and red onion. Sprinkle the remaining cheese on top and fold the tortilla in half. Cook in a skillet over medium heat until the cheese is melted and the tortilla is golden brown. Slice into wedges.",
    "page": 13
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chickpea and Spinach Wrap",
    "content": "Chickpea and Spinach Wrap - Ingredients: 1 whole wheat tortilla, 1/2 cup chickpeas, mashed, 1/4 cup spinach, chopped, 1/4 cup shredded carrots, 1 tablespoon tahini, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a bowl, combine the mashed chickpeas, spinach, carrots, tahini, and lemon juice. Season with salt and pepper. Lay the tortilla flat and spread the mixture evenly. Roll up the tortilla tightly and slice in half.",
    "page": 13
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Turkey and Apple Sandwich",
    "content": "Turkey and Apple Sandwich - Ingredients: 2 slices whole grain bread, 4 slices turkey breast, 1/2 apple, thinly sliced, 1/4 cup baby spinach, 1 tablespoon mustard or mayo Instructions: Spread mustard or mayo on one slice of bread. Layer the turkey, apple slices, and spinach on top. Top with the second slice of bread and cut in half.",
    "page": 14
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Mediterranean Tuna Salad",
    "content": "Mediterranean Tuna Salad - Ingredients: 1 can tuna, drained, 1/4 cup cherry tomatoes, halved, 1/4 cup cucumber, diced, 1/4 cup black olives, sliced, 1/4 cup feta cheese, crumbled, 2 tablespoons olive oil, 1 tablespoon lemon juice, Salt and pepper to taste Instructions: In a bowl, combine the tuna, tomatoes, cucumber, olives, and feta cheese. Drizzle with olive oil and lemon juice. Season with salt and pepper, then toss to combine.",
    "page": 14
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Chicken and Avocado Wrap",
    "content": "Chicken and Avocado Wrap - Ingredients: 1 whole wheat tortilla, 1 cup cooked chicken breast, sliced, 1/2 avocado, sliced, 1/4 cup baby spinach, 1 tablespoon ranch dressing Instructions: Lay the tortilla flat and spread the ranch dressing evenly. Add the chicken, avocado, and spinach. Roll up the tortilla tightly and slice in half.",
    "page": 15
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Lentil and Veggie Wrap",
    "content": "Lentil and Veggie Wrap - Ingredients: 1 whole wheat tortilla, 1/2 cup cooked lentils, 1/4 cup bell pepper, sliced, 1/4 cup cucumber, diced, 1/4 cup shredded carrots, 1 tablespoon hummus Instructions: Lay the tortilla flat and spread the hummus evenly. Add the lentils, bell pepper, cucumber, and carrots. Roll up the tortilla tightly and slice in half.",
    "page": 15
  },
  {
    "document": "Lunch Ideas.pdf",
    "title": "Turkey and Hummus Wrap",
    "content": "Turkey and Hummus Wrap - Ingredients: 1 whole wheat tortilla, 4 slices turkey breast, 1/4 cup hummus, 1/4 cup shredded carrots, 1/4 cup baby spinach Instructions: Lay the tortilla flat and spread the hummus evenly. Add the turkey, carrots, and spinach. Roll up the tortilla tightly and slice in half.",
    "page": 15
  }
]